text/20-petri-net-verifier.org
#+title: Chapter 20 : A Petri net verifier

* Introduction

Netver is a small verifier for Petri nets.  It takes as input a description of a Petri net together with one or more path expressions; it produces as output all possible sequences of firings of transitions, or sets of markings of places.  The path expressions give full control over the output that is produced.

Petri nets are difficult to analyse manually; but it is easy enough to write a simulator which produces as output possible firing sequences, or all possible markings that can lead to other markings.  The danger is that the designers then have to wade through enormous output to find what they want.  The verification tool to be described here attempts to avoid this by giving designers only the output they need.  The tool uses two techniques:

1) instead of working with markings of places it works with sets of markings, and
2) detailed control over the firing of transitions is given by a collection of primitives for programmed backtracking.

Jointly, though less so separately, the two techniques make it possible to introduce powerful primitives for the analysis of nets.

The remainder of the chapter is organised as follows:

- The next section introduces Petri nets in an elementary way, including a general description of how Netver operates.
- The next two sections give the syntax and the semantics of Netver, the format is (at least at this stage) kept very compact.
- The following section consists of many small examples.
- The implementation is described in the following section.
- A final section attempts to draw some conclusions and discusses future work.

For an understanding of Petri nets very little is assumed here, but see Peterson (1981) or Reisig (1982) for detail.  For an understanding of the verifier, it would be an advantage to have some familiarity with a backtracking language such as Snobol (Griswold et al, 1971), Icon (Griswold and Hanson, 1979), or Prolog (Clocksin and Mellish, 1981) or with the generators of Clu (Liskov et al, 1981) or Alphard (Shaw 1981).

* Nets and Netver

/Petri net/\s are a species of inputless nondeterministic automata.  The number of states may be finite or infinite, though the ones to be considered here are always finite.  A Petri net consists of a number of passive data components called /place/\s, together with a number of active processing components called /transition/\s.

The places constitute a factorisation of the set of states; they are variables whose values change over time as events occur.  The transitions are disjoint classes of events; the occurrence of an event in the class is often called a /firing/ of the transition.  The firing of transitions is subject to certain laws which do not change over time.  In many expositions the places, transitions and laws are displayed graphically; such a method will not be used here.

** Static descriptions of nets

Nets have places with an associated positive integer called the capacity of the place.  A place with capacity n is an integer variable whose values range from 0 to n.  In Netver a specification of four places, say =a=, = b=, = c=, = d=, might look like this:

#+begin_example
PLACE
    a, b, c : 1                 (* three places of capacity one *)
    d : 5;                      (* one place of capacity five   *)
#+end_example

The state of a net at any one time is given by an instantaneous description or /marking/ which says what values the place variables have, or how many /tokens/ they contain.  For the place capacities given, the total number of possible markings is 2 * 2 * 2 * 6 = 48.  For example, each of the following six lines describes a possible marking of the net:

#+begin_example
        a = 0   b = 1   c = 0   d = 2
        a = 0   b = 1   c = 0   d = 3
        a = 0   b = 1   c = 0   d = 4
        a = 0   b = 1   c = 1   d = 2
        a = 0   b = 1   c = 1   d = 3
        a = 0   b = 1   c = 1   d = 4
#+end_example

For many purposes it is desirable to allow disjunctions of instantaneous descriptions.  In Netver certain disjunctions are allowed, for example

#+begin_example
        a = [0]   b = [1]   c = [01]   d = [234]
#+end_example

This would express the disjunction of the six sentences given above.  Such a compact form, to be called a /hypermarking/, represents, not a state, but a set of states of the net, and Netver operates on such state sets.  At any one time a place is specified by a non-empty set of possible markings.  An empty set would be contradictory, and in Netver this never arises.  In the special case where each place contains a unit set, a state set in Netver is exactly the same as a state in an ordinary net.  Note that hypermarkings cannot express all disjunctions of markings, for example "place =a= is empty or place =b= is full" cannot be expressed.

