20-petri-net-verifier.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 20 : A Petri net verifier</title>
<!-- 2013-05-31 Fri 19:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="michal"/>
<link rel="stylesheet" type="text/css" href="/sympas/etc/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Chapter 20 : A Petri net verifier</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Nets and Netver</a>
<ul>
<li><a href="#sec-2-1">2.1. Static descriptions of nets</a></li>
<li><a href="#sec-2-2">2.2. Dynamic behaviour</a></li>
<li><a href="#sec-2-3">2.3. Control of behaviour</a></li>
<li><a href="#sec-2-4">2.4. Productions and actions</a></li>
<li><a href="#sec-2-5">2.5. Modes of behaviour</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Syntax</a>
<ul>
<li><a href="#sec-3-1">3.1. Lexical matters</a></li>
<li><a href="#sec-3-2">3.2. Context free syntax</a></li>
<li><a href="#sec-3-3">3.3. Context sensitive restrictions</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Semantics</a>
<ul>
<li><a href="#sec-4-1">4.1. Control primitives</a></li>
<li><a href="#sec-4-2">4.2. Mode selection</a></li>
<li><a href="#sec-4-3">4.3. Primitives from regular algebra</a></li>
<li><a href="#sec-4-4">4.4. Primitives from Boolean algebra</a></li>
<li><a href="#sec-4-5">4.5. Discrete event primitives</a></li>
<li><a href="#sec-4-6">4.6. State primitives</a></li>
<li><a href="#sec-4-7">4.7. Place primitives</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Examples</a></li>
<li><a href="#sec-6">6. Implementation</a></li>
<li><a href="#sec-7">7. <i>Compilation</i>:</a></li>
<li><a href="#sec-8">8. <i>Interpretation</i>:</a></li>
<li><a href="#sec-9">9. The program</a></li>
<li><a href="#sec-10">10. Discussion</a>
<ul>
<li><a href="#sec-10-1">10.1. Embellishments</a></li>
<li><a href="#sec-10-2">10.2. <i>Error recovery</i>:</a></li>
<li><a href="#sec-10-3">10.3. <i>String output</i>:</a></li>
<li><a href="#sec-10-4">10.4. More advanced backtracking</a></li>
<li><a href="#sec-10-5">10.5. <i>Regular and Boolean Algebra</i>:</a></li>
<li><a href="#sec-10-6">10.6. <i>Other Primitives</i>:</a></li>
<li><a href="#sec-10-7">10.7. <i>Optimisations</i>:</a></li>
<li><a href="#sec-10-8">10.8. A more powerful object language</a>
<ul>
<li><a href="#sec-10-8-1">10.8.1. <i>Folding of places</i>:</a></li>
<li><a href="#sec-10-8-2">10.8.2. <i>Predicate Transition Nets</i>:</a></li>
<li><a href="#sec-10-8-3">10.8.3. <i>Queueing places</i>:</a></li>
<li><a href="#sec-10-8-4">10.8.4. <i>Timed Petri Nets</i> (see e.g. Carlier et al 1984):</a></li>
<li><a href="#sec-10-8-5">10.8.5. <i>Parallelism in Paths</i>:</a></li>
<li><a href="#sec-10-8-6">10.8.6. <i>Ports</i>:</a></li>
<li><a href="#sec-10-8-7">10.8.7. <i>Reading</i>:</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Netver is a small verifier for Petri nets.  It takes as input a description of a Petri net together with one or more path expressions; it produces as output all possible sequences of firings of transitions, or sets of markings of places.  The path expressions give full control over the output that is produced.
</p>

<p>
Petri nets are difficult to analyse manually; but it is easy enough to write a simulator which produces as output possible firing sequences, or all possible markings that can lead to other markings.  The danger is that the designers then have to wade through enormous output to find what they want.  The verification tool to be described here attempts to avoid this by giving designers only the output they need.  The tool uses two techniques:
</p>

<ol class="org-ol">
<li>instead of working with markings of places it works with sets of markings, and
</li>
<li>detailed control over the firing of transitions is given by a collection of primitives for programmed backtracking.
</li>
</ol>

<p>
Jointly, though less so separately, the two techniques make it possible to introduce powerful primitives for the analysis of nets.
</p>

<p>
The remainder of the chapter is organised as follows:
</p>

<ul class="org-ul">
<li>The next section introduces Petri nets in an elementary way, including a general description of how Netver operates.
</li>
<li>The next two sections give the syntax and the semantics of Netver, the format is (at least at this stage) kept very compact.
</li>
<li>The following section consists of many small examples.
</li>
<li>The implementation is described in the following section.
</li>
<li>A final section attempts to draw some conclusions and discusses future work.
</li>
</ul>

<p>
For an understanding of Petri nets very little is assumed here, but see Peterson (1981) or Reisig (1982) for detail.  For an understanding of the verifier, it would be an advantage to have some familiarity with a backtracking language such as Snobol (Griswold et al, 1971), Icon (Griswold and Hanson, 1979), or Prolog (Clocksin and Mellish, 1981) or with the generators of Clu (Liskov et al, 1981) or Alphard (Shaw 1981).
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Nets and Netver</h2>
<div class="outline-text-2" id="text-2">
<p>
<i>Petri net</i>\s are a species of inputless nondeterministic automata.  The number of states may be finite or infinite, though the ones to be considered here are always finite.  A Petri net consists of a number of passive data components called <i>place</i>\s, together with a number of active processing components called <i>transition</i>\s.
</p>

<p>
The places constitute a factorisation of the set of states; they are variables whose values change over time as events occur.  The transitions are disjoint classes of events; the occurrence of an event in the class is often called a <i>firing</i> of the transition.  The firing of transitions is subject to certain laws which do not change over time.  In many expositions the places, transitions and laws are displayed graphically; such a method will not be used here.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Static descriptions of nets</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Nets have places with an associated positive integer called the capacity of the place.  A place with capacity n is an integer variable whose values range from 0 to n.  In Netver a specification of four places, say <code>a</code>, = b=, = c=, = d=, might look like this:
</p>

<pre class="example">
PLACE
    a, b, c : 1                 (* three places of capacity one *)
    d : 5;                      (* one place of capacity five   *)
</pre>

<p>
The state of a net at any one time is given by an instantaneous description or <i>marking</i> which says what values the place variables have, or how many <i>tokens</i> they contain.  For the place capacities given, the total number of possible markings is 2 * 2 * 2 * 6 = 48.  For example, each of the following six lines describes a possible marking of the net:
</p>

<pre class="example">
a = 0   b = 1   c = 0   d = 2
a = 0   b = 1   c = 0   d = 3
a = 0   b = 1   c = 0   d = 4
a = 0   b = 1   c = 1   d = 2
a = 0   b = 1   c = 1   d = 3
a = 0   b = 1   c = 1   d = 4
</pre>

<p>
For many purposes it is desirable to allow disjunctions of instantaneous descriptions.  In Netver certain disjunctions are allowed, for example
</p>

<pre class="example">
a = [0]   b = [1]   c = [01]   d = [234]
</pre>

<p>
This would express the disjunction of the six sentences given above.  Such a compact form, to be called a <i>hypermarking</i>, represents, not a state, but a set of states of the net, and Netver operates on such state sets.  At any one time a place is specified by a non-empty set of possible markings.  An empty set would be contradictory, and in Netver this never arises.  In the special case where each place contains a unit set, a state set in Netver is exactly the same as a state in an ordinary net.  Note that hypermarkings cannot express all disjunctions of markings, for example "place <code>a</code> is empty or place <code>b</code> is full" cannot be expressed.
</p>
</div>
</div>
