text/20-petri-net-verifier.org
** Dynamic behaviour

The state of a system changes when events occur.  The occurrence of an event depends on some condition, and the occurrence of an event produces some effect.

In nets the only events are /transition firing/\s, and the only conditions are the markings of places, and the only effects are on the markings of places.  Transitions and their firing behaviour are specified by input arcs from places and output arcs to places, and each arc has an associated positive integer not exceeding the capacity of the place from which it comes or to which it goes.

The firing of a transition depends on the condition that

1) at each place from which there is an input arc there are at least as many tokens as specified by the arc, and
2) at each place to which there is an output arc there are at least as many vacancies as specified by the arc.

The firing of a transition has the effect that
1) at each place from which there is an input arc the number of tokens is decreased by as many tokens as specified by the input arc, and
2) at each place to which there is an output arc the number of tokens is increased by as many tokens as specified by the output arc.

In Netver declarations of, say, three transitions =t=, =u=, =v=
and their associated arcs might look like this:

#+begin_example
TRANSITION
    t  INARC a 1; OUTARC b,c 1;
    u  INARC b 1; OUTARC d 3;
    v  INARC c 1; INARC d 2; OUTARC a,b 1;
#+end_example

In the example given, transition =v= may fire if place =c= contains one token, place =d= contains at least two tokens, and places =a= and =b= have one vacancy each.  If transition =v= does fire, then the token is removed from =c=, two tokens are removed from =d=, and one token is added to each of =a= and =b=.

A net is normally given an initial marking of the places and then allowed to run.  Because of the indeterminism, many different sequences of transition firings can result.  In Netver places have hypermarkings, and a special case of a hypermarking is a non-disjunctive marking in which for each place it is specified exactly how many tokens it contains.  Therefore Netver can be used to simulate the running of initialised nets.  An initialisation might take the form:

#+begin_example
    SET a 1   SET b 0   SET c 1   SET d 2
#+end_example

This assigns to each place a, b, c, d a marking given by the numeral following.  However, it is also possible to give a partial initialisation, such as

#+begin_example
    SET a 0   SET b 1   SET c 0 1   SET d 2 3 4
#+end_example

This gives the net the disjunctive hypermarking used in the previous section.

** Control of behaviour

Netver is designed to analyse sequences of firings of nets with hypermarkings.  To avoid the generation of sequences that are of no interest to the designer of the net, mechanisms are provided to allow arbitrarily tight control over the firings.  Sequences of firings are just strings over an alphabet whose vocabulary is the set of transitions, and hence the possible behaviour of a net is essentially a language over the transitions.  Since nets are typically designed to run forever, their language contains infinitely long sequences.  For a mathematical understanding, the work of Engelfriet (1974) on program schemes is applicable here.

To analyse finite portions of the language, Netver uses concepts familiar from formal language theory, in particular /path expression/s, which are essentially regular expressions with several extensions.  A backtracking mechanism handles the generation of all and only those firing sequences which

1) can be produced by the net, /and/
2) the user wants to know about.

Path expressions are built from atomic operands and a few operators.  The atoms are transitions, and the operations include at least a binary operation of composition, a binary operation of alternation, and a unary operation of indefinite repetition.  Using, say, the four transitions =t=, =u=, =v=, =w= as atoms, the construction

#+begin_example
        composition(alternation(t,u), alternation(v,w))
#+end_example

is written
             (t | u) (v | w)
and it means:

- first fire either =t= or =u=,
- and then fire either =u= or =v=.

By the distribution of composition over alternation, the above expression is equivalent to

#+begin_example
        t v   |   t w   |   u v   |   u w
#+end_example

This is how the expansion appears to the user; but internally the verifier avoids having to fire =t= and =u= twice by treating it as

#+begin_example
        t (v | w)   |   u (v | w)
#+end_example

Path expressions have been used by Campbell and Habermann (1974) for specifying process synchronisation; their use here for a verifier is quite different.

Because of the backtracking, the behaviour of Netver is similar to that of Prolog (see for example Clocksin and Mellish, 1981):

1) The set of solutions that will be found, considered as an unordered set, depends only on the set of defined or allowed paths, also considered as an unordered set.

2) The sequence of solutions that will be found, now considered as an ordered set, depends on the sequence of defined or allowed paths, also considered in their order.

In particular, the idempotent law, which says that the disjunction =p | p= is equivalent to just =p=, and the commutative law, which says that =p | q= is equivalent to =q | p=, hold for unordered solution sets but not for ordered solution sets.

In addition to the primitives from formal language theory or regular algebra, there are =LOGICAL= variables --- in the sense of propositional calculus or Boolean algebra, not in the sense of Prolog.  These can be used to structure execution paths in a clean way.  However, very little is known at this stage about the interplay between the concepts from the two algebras.  Hence the inclusion of logical variables is quite tentative.

Apart from the clean primitives from regular and Boolean algebra, Netver has several powerful and useful primitives which render it impure in the same way that Prolog is rendered impure by cut, assert, retract, numbervars etc.  Netver's impure primitives are =ABORT=, =FENCE=, =NEWSCOPE=, =MAXLENGTH=, =MAXPATHS= and a few others having to do with saved states; these primitives are described in detail in the manual.

