20-petri-net-verifier.html
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Dynamic behaviour</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The state of a system changes when events occur.  The occurrence of an event depends on some condition, and the occurrence of an event produces some effect.
</p>

<p>
In nets the only events are <i>transition firing</i>\s, and the only conditions are the markings of places, and the only effects are on the markings of places.  Transitions and their firing behaviour are specified by input arcs from places and output arcs to places, and each arc has an associated positive integer not exceeding the capacity of the place from which it comes or to which it goes.
</p>

<p>
The firing of a transition depends on the condition that
</p>

<ol class="org-ol">
<li>at each place from which there is an input arc there are at least as many tokens as specified by the arc, and
</li>
<li>at each place to which there is an output arc there are at least as many vacancies as specified by the arc.
</li>
</ol>

<p>
The firing of a transition has the effect that
</p>
<ol class="org-ol">
<li>at each place from which there is an input arc the number of tokens is decreased by as many tokens as specified by the input arc, and
</li>
<li>at each place to which there is an output arc the number of tokens is increased by as many tokens as specified by the output arc.
</li>
</ol>

<p>
In Netver declarations of, say, three transitions <code>t</code>, <code>u</code>, <code>v</code>
and their associated arcs might look like this:
</p>

<pre class="example">
TRANSITION
    t  INARC a 1; OUTARC b,c 1;
    u  INARC b 1; OUTARC d 3;
    v  INARC c 1; INARC d 2; OUTARC a,b 1;
</pre>

<p>
In the example given, transition <code>v</code> may fire if place <code>c</code> contains one token, place <code>d</code> contains at least two tokens, and places <code>a</code> and <code>b</code> have one vacancy each.  If transition <code>v</code> does fire, then the token is removed from <code>c</code>, two tokens are removed from <code>d</code>, and one token is added to each of <code>a</code> and <code>b</code>.
</p>

<p>
A net is normally given an initial marking of the places and then allowed to run.  Because of the indeterminism, many different sequences of transition firings can result.  In Netver places have hypermarkings, and a special case of a hypermarking is a non-disjunctive marking in which for each place it is specified exactly how many tokens it contains.  Therefore Netver can be used to simulate the running of initialised nets.  An initialisation might take the form:
</p>

<pre class="example">
SET a 1   SET b 0   SET c 1   SET d 2
</pre>

<p>
This assigns to each place a, b, c, d a marking given by the numeral following.  However, it is also possible to give a partial initialisation, such as
</p>

<pre class="example">
SET a 0   SET b 1   SET c 0 1   SET d 2 3 4
</pre>

<p>
This gives the net the disjunctive hypermarking used in the previous section.
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Control of behaviour</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Netver is designed to analyse sequences of firings of nets with hypermarkings.  To avoid the generation of sequences that are of no interest to the designer of the net, mechanisms are provided to allow arbitrarily tight control over the firings.  Sequences of firings are just strings over an alphabet whose vocabulary is the set of transitions, and hence the possible behaviour of a net is essentially a language over the transitions.  Since nets are typically designed to run forever, their language contains infinitely long sequences.  For a mathematical understanding, the work of Engelfriet (1974) on program schemes is applicable here.
</p>

<p>
To analyse finite portions of the language, Netver uses concepts familiar from formal language theory, in particular /path expression/s, which are essentially regular expressions with several extensions.  A backtracking mechanism handles the generation of all and only those firing sequences which
</p>

<ol class="org-ol">
<li>can be produced by the net, <i>and</i>
</li>
<li>the user wants to know about.
</li>
</ol>

<p>
Path expressions are built from atomic operands and a few operators.  The atoms are transitions, and the operations include at least a binary operation of composition, a binary operation of alternation, and a unary operation of indefinite repetition.  Using, say, the four transitions <code>t</code>, <code>u</code>, <code>v</code>, <code>w</code> as atoms, the construction
</p>

<pre class="example">
composition(alternation(t,u), alternation(v,w))
</pre>

<p>
is written
             (t | u) (v | w)
and it means:
</p>

<ul class="org-ul">
<li>first fire either <code>t</code> or <code>u</code>,
</li>
<li>and then fire either <code>u</code> or <code>v</code>.
</li>
</ul>

<p>
By the distribution of composition over alternation, the above expression is equivalent to
</p>

<pre class="example">
t v   |   t w   |   u v   |   u w
</pre>

<p>
This is how the expansion appears to the user; but internally the verifier avoids having to fire <code>t</code> and <code>u</code> twice by treating it as
</p>

<pre class="example">
t (v | w)   |   u (v | w)
</pre>

<p>
Path expressions have been used by Campbell and Habermann (1974) for specifying process synchronisation; their use here for a verifier is quite different.
</p>

<p>
Because of the backtracking, the behaviour of Netver is similar to that of Prolog (see for example Clocksin and Mellish, 1981):
</p>

<ol class="org-ol">
<li>The set of solutions that will be found, considered as an unordered set, depends only on the set of defined or allowed paths, also considered as an unordered set.
</li>

<li>The sequence of solutions that will be found, now considered as an ordered set, depends on the sequence of defined or allowed paths, also considered in their order.
</li>
</ol>

<p>
In particular, the idempotent law, which says that the disjunction <code>p | p</code> is equivalent to just <code>p</code>, and the commutative law, which says that <code>p | q</code> is equivalent to <code>q | p</code>, hold for unordered solution sets but not for ordered solution sets.
</p>

<p>
In addition to the primitives from formal language theory or regular algebra, there are <code>LOGICAL</code> variables &#x2014; in the sense of propositional calculus or Boolean algebra, not in the sense of Prolog.  These can be used to structure execution paths in a clean way.  However, very little is known at this stage about the interplay between the concepts from the two algebras.  Hence the inclusion of logical variables is quite tentative.
</p>

<p>
Apart from the clean primitives from regular and Boolean algebra, Netver has several powerful and useful primitives which render it impure in the same way that Prolog is rendered impure by cut, assert, retract, numbervars etc.  Netver's impure primitives are <code>ABORT</code>, <code>FENCE</code>, <code>NEWSCOPE</code>, <code>MAXLENGTH</code>, <code>MAXPATHS</code> and a few others having to do with saved states; these primitives are described in detail in the manual.
</p>
</div>
</div>
