text/20-petri-net-verifier.org
** Productions and actions

It is useful to be able to write a path expression just once and then refer to it repeatedly by its name.  For this purpose Netver has /production/s similar to those used in grammars.  Identifiers declared in a production are just like the non-terminals of a grammar, and transitions are just like the terminals of a grammar.  A path expression then is built up by means of the regular expression operators from atoms that have been declared in transition or production declarations.  Transition firings count as events and will be recorded for possible printout, whereas non-terminals of productions do not count as events and hence are not recorded.  (It is still an open question whether the recording should perhaps be independently under user control.)

Path expressions may also be attached to transitions by =ACTION= declarations.  A transition thus augmented may fire if its arcs and its path expression allow it.  If it does fire then its explicitly attached places are updated in accordance with its arcs, and any transition in its path is also fired, thus possibly affecting other places indirectly.

** Modes of behaviour

For a verifier it is useful to be able to distinguish between
1) a transition being enabled and hence being fired, and
2) a transition being enabled but not being fired.
The first is an event which produces a change, the second is merely a condition for such an event.  In order to be able to distinguish the two, Netver can operate in several modes:

1) In execution mode, the occurrence of a transition identifier in a path causes an attempt to fire the transition and hence to change the (hyper-)marking of the places to which it is connected; if this succeeds the path is continued, otherwise backtracking occurs.

2) In verification mode, the occurrence of a transition identifier in a path merely causes the firing condition of the transition to be tested, by attempting to find a nonempty intersection of the current (hyper-)marking with the marking that would enable the firing; if this succeeds the path is continued, otherwise backtracking occurs.

3) There is a third mode, possibility mode, which is like verification mode except that it merely tests whether there is a nonempty intersection; in this mode the hypermarkings are left untouched.

The distinction between verification mode and possibility mode only makes sense in a system whose states are sets of states of a simulated system.  Further investigation is needed to determine how useful the third mode really is.

* Syntax

The input language is fairly conventional in its conception; it has user declared identifiers in lower case, reserved words in upper case, and a small number of punctuation characters.  The syntax has some obvious context sensitive restrictions concerning declarations of identifiers.

** Lexical matters

The lexicon is here given in a semi-formal way only.

#+begin_example
identifier  ::=
        lower case letter,
        followed by up to 15 further letters or digits or underscores
number  ::=
        one or more digits
reserved word  ::=
        see the terminals of the BNF below,
        in the BNF the terminals are enclosed in double quotes.
comment  ::=
        as in Pascal, any text enclosed in "(*" and "*)".
#+end_example

In addition, the directives from the utilities in Chapter 17 may be used.

** Context free syntax

Again the syntax below is given in an extended form of BNF: Alternation is represented as =|=; concatenation is represented (without a symbol) as juxtaposition, and it binds more strongly than alternation; precedences may be overridden by (round) parentheses; repetitions (zero or more times) are enclosed in (square) brackets; options (zero or one times) are enclosed in (curly) braces.

#+begin_example
input  ::=
        [block ["PATH" expression {";"}] "."]
block  ::=
        [   "PLACE"
              [ identifier ["," identifier]
                {":"} {number} {";"}  ]
          | "TRANSITION"
              [ identifier ["," identifier]
                [  ("INARC" | "OUTARC")
                     [identifier ["," identifier] {number}]
                  | "ACTION"
                    expression  ] ] {";"}
          | "LOGICAL"
              [ identifier ["," identifier] ] {";"}
          | "PRODUCTION"
              [identifier "::=" expression {";"}]  ]
expression  ::=
        term ["|" term]
term  ::=
        factor [ factor ]
factor  ::=
          identifier
        | ( "NET" | "SKIP" | "FAIL" | "ABORT" | "QUIT" | "SHOW_PATH"
            "DEADLOCK" | "UNREACHABLE" | "SHOW_MARKINGS" | "FENCE" )
        | ( "EXECUTE" | "VERIFY" | "POSSIBLY" |
            "OPT" | "POS" | "REP" | "NOT")  factor
        | ( "LEN" | "TAB" | "MAXLENGTH" | "MAXPATHS" | "POSITION" |
            "SAVE" | "RESTORE" |
            "SAMESTATE" | "SUBSTATE" | "SUPERSTATE"  ) number
        | "TIMES" number factor
        | "EMPTY" identifier
        | ( "ATLEAST" | "ATMOST" ) identifier number
        | "SET" identifier [number]
        | "(" expression ")"
#+end_example

As may be seen from the syntax, the input language has been made as tolerant to minor syntactic variations as possible.  However, there are the following context free restrictions, all derived from the syntax.

If a mandatory identifier is missing, the error is always context sensitive, the exact error message is given in the next section.

In =PLACE= declarations, and also in =INARC= and =OUTARC= declarations, the number is optional; if it is not given explicitly, =1= is assumed.

In a =PRODUCTION= declaration the (non-terminal) identifier has to be followed by =::==, otherwise the error ="'::=' expected"= is reported.

In factors requiring one number, such as those beginning =TIMES=, =LEN=, =MAXLENGTH=, =POSITION=, and =TAB=, the lack of a number results in the error =number expected= to be reported.

In a factor beginning with a parenthesis there must be a closing parenthesis, otherwise the error ="')' expected"= is reported.

