20-petri-net-verifier.html
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Productions and actions</h3>
<div class="outline-text-3" id="text-2-4">
<p>
It is useful to be able to write a path expression just once and then refer to it repeatedly by its name.  For this purpose Netver has /production/s similar to those used in grammars.  Identifiers declared in a production are just like the non-terminals of a grammar, and transitions are just like the terminals of a grammar.  A path expression then is built up by means of the regular expression operators from atoms that have been declared in transition or production declarations.  Transition firings count as events and will be recorded for possible printout, whereas non-terminals of productions do not count as events and hence are not recorded.  (It is still an open question whether the recording should perhaps be independently under user control.)
</p>

<p>
Path expressions may also be attached to transitions by <code>ACTION</code> declarations.  A transition thus augmented may fire if its arcs and its path expression allow it.  If it does fire then its explicitly attached places are updated in accordance with its arcs, and any transition in its path is also fired, thus possibly affecting other places indirectly.
</p>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Modes of behaviour</h3>
<div class="outline-text-3" id="text-2-5">
<p>
For a verifier it is useful to be able to distinguish between
</p>
<ol class="org-ol">
<li>a transition being enabled and hence being fired, and
</li>
<li>a transition being enabled but not being fired.
</li>
</ol>
<p>
The first is an event which produces a change, the second is merely a condition for such an event.  In order to be able to distinguish the two, Netver can operate in several modes:
</p>

<ol class="org-ol">
<li>In execution mode, the occurrence of a transition identifier in a path causes an attempt to fire the transition and hence to change the (hyper-)marking of the places to which it is connected; if this succeeds the path is continued, otherwise backtracking occurs.
</li>

<li>In verification mode, the occurrence of a transition identifier in a path merely causes the firing condition of the transition to be tested, by attempting to find a nonempty intersection of the current (hyper-)marking with the marking that would enable the firing; if this succeeds the path is continued, otherwise backtracking occurs.
</li>

<li>There is a third mode, possibility mode, which is like verification mode except that it merely tests whether there is a nonempty intersection; in this mode the hypermarkings are left untouched.
</li>
</ol>

<p>
The distinction between verification mode and possibility mode only makes sense in a system whose states are sets of states of a simulated system.  Further investigation is needed to determine how useful the third mode really is.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Syntax</h2>
<div class="outline-text-2" id="text-3">
<p>
The input language is fairly conventional in its conception; it has user declared identifiers in lower case, reserved words in upper case, and a small number of punctuation characters.  The syntax has some obvious context sensitive restrictions concerning declarations of identifiers.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Lexical matters</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The lexicon is here given in a semi-formal way only.
</p>

<pre class="example">
identifier  ::=
        lower case letter,
        followed by up to 15 further letters or digits or underscores
number  ::=
        one or more digits
reserved word  ::=
        see the terminals of the BNF below,
        in the BNF the terminals are enclosed in double quotes.
comment  ::=
        as in Pascal, any text enclosed in "(*" and "*)".
</pre>

<p>
In addition, the directives from the utilities in Chapter 17 may be used.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Context free syntax</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Again the syntax below is given in an extended form of BNF: Alternation is represented as <code>|</code>; concatenation is represented (without a symbol) as juxtaposition, and it binds more strongly than alternation; precedences may be overridden by (round) parentheses; repetitions (zero or more times) are enclosed in (square) brackets; options (zero or one times) are enclosed in (curly) braces.
</p>

<pre class="example">
input  ::=
        [block ["PATH" expression {";"}] "."]
block  ::=
        [   "PLACE"
              [ identifier ["," identifier]
                {":"} {number} {";"}  ]
          | "TRANSITION"
              [ identifier ["," identifier]
                [  ("INARC" | "OUTARC")
                     [identifier ["," identifier] {number}]
                  | "ACTION"
                    expression  ] ] {";"}
          | "LOGICAL"
              [ identifier ["," identifier] ] {";"}
          | "PRODUCTION"
              [identifier "::=" expression {";"}]  ]
expression  ::=
        term ["|" term]
term  ::=
        factor [ factor ]
factor  ::=
          identifier
        | ( "NET" | "SKIP" | "FAIL" | "ABORT" | "QUIT" | "SHOW_PATH"
            "DEADLOCK" | "UNREACHABLE" | "SHOW_MARKINGS" | "FENCE" )
        | ( "EXECUTE" | "VERIFY" | "POSSIBLY" |
            "OPT" | "POS" | "REP" | "NOT")  factor
        | ( "LEN" | "TAB" | "MAXLENGTH" | "MAXPATHS" | "POSITION" |
            "SAVE" | "RESTORE" |
            "SAMESTATE" | "SUBSTATE" | "SUPERSTATE"  ) number
        | "TIMES" number factor
        | "EMPTY" identifier
        | ( "ATLEAST" | "ATMOST" ) identifier number
        | "SET" identifier [number]
        | "(" expression ")"
</pre>

<p>
As may be seen from the syntax, the input language has been made as tolerant to minor syntactic variations as possible.  However, there are the following context free restrictions, all derived from the syntax.
</p>

<p>
If a mandatory identifier is missing, the error is always context sensitive, the exact error message is given in the next section.
</p>

<p>
In <code>PLACE</code> declarations, and also in <code>INARC</code> and <code>OUTARC</code> declarations, the number is optional; if it is not given explicitly, <code>1</code> is assumed.
</p>

<p>
In a <code>PRODUCTION</code> declaration the (non-terminal) identifier has to be followed by <code>::=</code>, otherwise the error ="'::=' expected"= is reported.
</p>

<p>
In factors requiring one number, such as those beginning <code>TIMES</code>, <code>LEN</code>, <code>MAXLENGTH</code>, <code>POSITION</code>, and <code>TAB</code>, the lack of a number results in the error <code>number expected</code> to be reported.
</p>

<p>
In a factor beginning with a parenthesis there must be a closing parenthesis, otherwise the error ="')' expected"= is reported.
</p>
</div>
</div>
