text/20-petri-net-verifier.org
** Context sensitive restrictions

There are some context sensitive restrictions having to do with declarations of identifiers.

Inside a block, the three kinds of declarations =PLACE=, =TRANSITION= and =LOGICAL= must introduce new identifiers; otherwise the error ="new identifier expected"= is reported.

In a transition declaration the =INARC= and =OUTARC= declarations must be followed by an identifier that has been previously declared to be a place; otherwise the error ="place identifier expected"= is reported.

In a =PRODUCTION= declaration the identifier must be either new or have been used previously only inside factors, otherwise the error ="nonterminal expected"= is reported.

At the end of the block, any identifier =xxx= first used inside a factor must have been declared in a =PRODUCTION= declaration, otherwise the error ="xxx is undefined"= is reported.  (Thus use before declaration is permitted.)

In a factor consisting of just an identifier, the identifier must be either a previously declared transition or logical or non-terminal identifier, or it must be a new identifier which will henceforth be treated as a non-terminal identifier; if it is a place identifier the error ="place identifier illegal"= is reported.

Factors beginning =SET=, =EMPTY=, =ATLEAST= or =ATMOST= must be followed by an identifier that has been previously declared to be a place; otherwise the error ="place identifier expected"= is reported.

The Netver system has a number of inbuilt constraints concerning the sizes of various tables.  This affects the number of identifiers which can be declared, the size of the code for transitions and paths, the number of places and logical variables which the system can handle at run time, and the product of the number of places and the number of savesets.  Since no final decisions have been made about the sizes of these tables, it would be premature to document them in this preliminary version.

* Semantics

In the following,
- =pe=, =pe1= and =pe2= are any path expressions,
- =n= is any natural number,
- =Pid= is any place identifier,
- =Tid= is any transition identifier,
- =Nid= is any non-terminal identifier,
- =Lid= is any logical identifier.

** Control primitives

The following are the primitives for control; they are independent of the backtracking mechanism.

1. =ABORT= Stops execution of this path; prepares to read another path (if any) or net (if any).
2. =QUIT= Stops execution altogether; exits to command level.
3. =Nid= If a non-terminal =Nid= has been declared by a production of the form =Nid ::\equal pe=, then a call of =Nid= is equivalent to =pe=. Recursion is permitted, though left recursion is possible only as the last disjunct of a disjunction.

** Mode selection

The three modes are selected by unary operators:

- =EXECUTE  pe= Attempts =pe= in execution mode. This is the default mode.
- =VERIFY  pe= Attempts =pe= in verification mode, with the goal set to =true=.
- =POSSIBLY  pe= Attempts =pe= in possibility mode, with the goal set to =true=.

** Primitives from regular algebra

The first few concepts are entirely general; they belong to any language with programmed backtracking, and they do not involve anything specific to nets.  The concepts are independent of the current mode.

<OL>
<LI> =SKIP          = <BR>
Does nothing. Always succeeds.
<LI> =FAIL          = <BR>
Does nothing. Never succeeds.
<LI> =pe1  pe2          = <BR>
The composition of two path expressions causes the first
to be attempted, and if that succeeds, causes the second
to be attempted.
Succeeds if both succeed in that order.
<LI> =pe1  |  pe2          = <BR>
The alternation of two path expressions causes the first
to be attempted, and on backtracking causes the second
to be attempted.
<LI> =TIMES  n  pe          = <BR>
The n-th power of =pe=.
Equivalent to
=pe pe ... pe= (n times).
<LI> =REP  pe          = <BR>
The alternation of all powers of =pe=.
Equivalent to
=SKIP | pe | pe pe | pe pe pe | ...=
<LI> =POS  pe          = <BR>
The alternation of all positive powers of =pe=.
Equivalent to =pe | pe pe | pe pe pe | pe pe pe pe | ...=.
<LI> =OPT  pe          = <BR>
The alternation of the first two powers of =pe=.
Equivalent to =SKIP | pe=.
</OL>

The next few primitives specifically rely on the ordering of alternands.  Hence for path expressions containing these primitives the commutativity and idempotency of alternation do not hold.

<OL>
<LI> =PATHNUM  n          = <BR>
Succeeds if the current path is the =n=-th,
otherwise fails.
Every path that is completed increments a counter,
paths that fail before completion are not counted.
<LI> =MAXPATHS  n          = <BR>
Sets the maximum number of paths to be attempted to =n=.
When this maximum is reached,
everything fails
and backtracking occurs up to the current point.
Always succeeds, undone on backtracking.
<LI> =SHOWTOTAL          = <BR>
Sets a global switch; if this switch has been set,
then at the end of the execution the total
number of successful paths will be printed.
</OL>

The remaining primitives in this section deal specifically with backtracking execution of paths.

<OL>
<LI> =FENCE          = <BR>
When occurring in a disjunct of a disjunction,
its execution causes a flag to be set which
prevents any later disjunct from being attempted.
Always succeeds; the setting of the flag is not undone on backtracking.
<LI> =NEWSCOPE  pe          = <BR>
Declares a local scope for =FENCE=.
Succeeds if =pe= succeeds.
It works by creating a new flag for =FENCE=;
upon backtracking the old flag is restored.
</OL>

Note that these primitives were from regular algebra only --- there were no events, no firings, no places, nothing to do with nets.

