20-petri-net-verifier.html
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Context sensitive restrictions</h3>
<div class="outline-text-3" id="text-3-3">
<p>
There are some context sensitive restrictions having to do with declarations of identifiers.
</p>

<p>
Inside a block, the three kinds of declarations <code>PLACE</code>, <code>TRANSITION</code> and <code>LOGICAL</code> must introduce new identifiers; otherwise the error ="new identifier expected"= is reported.
</p>

<p>
In a transition declaration the <code>INARC</code> and <code>OUTARC</code> declarations must be followed by an identifier that has been previously declared to be a place; otherwise the error ="place identifier expected"= is reported.
</p>

<p>
In a <code>PRODUCTION</code> declaration the identifier must be either new or have been used previously only inside factors, otherwise the error ="nonterminal expected"= is reported.
</p>

<p>
At the end of the block, any identifier <code>xxx</code> first used inside a factor must have been declared in a <code>PRODUCTION</code> declaration, otherwise the error ="xxx is undefined"= is reported.  (Thus use before declaration is permitted.)
</p>

<p>
In a factor consisting of just an identifier, the identifier must be either a previously declared transition or logical or non-terminal identifier, or it must be a new identifier which will henceforth be treated as a non-terminal identifier; if it is a place identifier the error ="place identifier illegal"= is reported.
</p>

<p>
Factors beginning <code>SET</code>, <code>EMPTY</code>, <code>ATLEAST</code> or <code>ATMOST</code> must be followed by an identifier that has been previously declared to be a place; otherwise the error ="place identifier expected"= is reported.
</p>

<p>
The Netver system has a number of inbuilt constraints concerning the sizes of various tables.  This affects the number of identifiers which can be declared, the size of the code for transitions and paths, the number of places and logical variables which the system can handle at run time, and the product of the number of places and the number of savesets.  Since no final decisions have been made about the sizes of these tables, it would be premature to document them in this preliminary version.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Semantics</h2>
<div class="outline-text-2" id="text-4">
<p>
In the following,
</p>
<ul class="org-ul">
<li><code>pe</code>, <code>pe1</code> and <code>pe2</code> are any path expressions,
</li>
<li><code>n</code> is any natural number,
</li>
<li><code>Pid</code> is any place identifier,
</li>
<li><code>Tid</code> is any transition identifier,
</li>
<li><code>Nid</code> is any non-terminal identifier,
</li>
<li><code>Lid</code> is any logical identifier.
</li>
</ul>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Control primitives</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The following are the primitives for control; they are independent of the backtracking mechanism.
</p>

<ol class="org-ol">
<li><code>ABORT</code> Stops execution of this path; prepares to read another path (if any) or net (if any).
</li>
<li><code>QUIT</code> Stops execution altogether; exits to command level.
</li>
<li><code>Nid</code> If a non-terminal <code>Nid</code> has been declared by a production of the form <code>Nid ::\equal pe</code>, then a call of <code>Nid</code> is equivalent to <code>pe</code>. Recursion is permitted, though left recursion is possible only as the last disjunct of a disjunction.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Mode selection</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The three modes are selected by unary operators:
</p>

<ul class="org-ul">
<li><code>EXECUTE  pe</code> Attempts <code>pe</code> in execution mode. This is the default mode.
</li>
<li><code>VERIFY  pe</code> Attempts <code>pe</code> in verification mode, with the goal set to <code>true</code>.
</li>
<li><code>POSSIBLY  pe</code> Attempts <code>pe</code> in possibility mode, with the goal set to <code>true</code>.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Primitives from regular algebra</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The first few concepts are entirely general; they belong to any language with programmed backtracking, and they do not involve anything specific to nets.  The concepts are independent of the current mode.
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; =SKIP          = &lt;BR&gt;
Does nothing. Always succeeds.
&lt;LI&gt; =FAIL          = &lt;BR&gt;
Does nothing. Never succeeds.
&lt;LI&gt; =pe1  pe2          = &lt;BR&gt;
The composition of two path expressions causes the first
to be attempted, and if that succeeds, causes the second
to be attempted.
Succeeds if both succeed in that order.
&lt;LI&gt; =pe1  |  pe2          = &lt;BR&gt;
The alternation of two path expressions causes the first
to be attempted, and on backtracking causes the second
to be attempted.
&lt;LI&gt; <code>TIMES  n  pe          = &lt;BR&gt;
The n-th power of =pe</code>.
Equivalent to
<code>pe pe &#x2026; pe</code> (n times).
&lt;LI&gt; <code>REP  pe          = &lt;BR&gt;
The alternation of all powers of =pe</code>.
Equivalent to
<code>SKIP | pe | pe pe | pe pe pe | &#x2026;</code>
&lt;LI&gt; <code>POS  pe          = &lt;BR&gt;
The alternation of all positive powers of =pe</code>.
Equivalent to <code>pe | pe pe | pe pe pe | pe pe pe pe | &#x2026;</code>.
&lt;LI&gt; <code>OPT  pe          = &lt;BR&gt;
The alternation of the first two powers of =pe</code>.
Equivalent to <code>SKIP | pe</code>.
&lt;/OL&gt;
</p>

<p>
The next few primitives specifically rely on the ordering of alternands.  Hence for path expressions containing these primitives the commutativity and idempotency of alternation do not hold.
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; <code>PATHNUM  n          = &lt;BR&gt;
Succeeds if the current path is the =n</code>-th,
otherwise fails.
Every path that is completed increments a counter,
paths that fail before completion are not counted.
&lt;LI&gt; <code>MAXPATHS  n          = &lt;BR&gt;
Sets the maximum number of paths to be attempted to =n</code>.
When this maximum is reached,
everything fails
and backtracking occurs up to the current point.
Always succeeds, undone on backtracking.
&lt;LI&gt; =SHOWTOTAL          = &lt;BR&gt;
Sets a global switch; if this switch has been set,
then at the end of the execution the total
number of successful paths will be printed.
&lt;/OL&gt;
</p>

<p>
The remaining primitives in this section deal specifically with backtracking execution of paths.
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; =FENCE          = &lt;BR&gt;
When occurring in a disjunct of a disjunction,
its execution causes a flag to be set which
prevents any later disjunct from being attempted.
Always succeeds; the setting of the flag is not undone on backtracking.
&lt;LI&gt; <code>NEWSCOPE  pe          = &lt;BR&gt;
Declares a local scope for =FENCE</code>.
Succeeds if <code>pe</code> succeeds.
It works by creating a new flag for <code>FENCE</code>;
upon backtracking the old flag is restored.
&lt;/OL&gt;
</p>

<p>
Note that these primitives were from regular algebra only &#x2014; there were no events, no firings, no places, nothing to do with nets.
</p>
</div>
</div>
