text/20-petri-net-verifier.org
** Primitives from Boolean algebra

The following concepts are dependent on the current mode.  In execution mode they are independent of the current goal; in the other modes they are only dependent on the goal.

<OL>
<LI> =TRUE          = <BR>
In execution mode, always succeeds.
In the other modes, succeeds if the goal is =true=.
<LI> =FALSE          = <BR>
In execution mode, always fails.
In the other modes, succeeds if the goal is =false=.
<LI> =Lid          = <BR>
In execution mode, attempts to make the logical variable =Lid=
true.
In the other modes, attempts to give =Lid=
the value of the current goal.
<LI> =pe1  AND  pe2          = <BR>
In execution mode, equivalent to the composition =pe1  pe2=.
In the other modes, attempts to make the
conjunction of the two expressions true or false,
depending on the current goal.
<LI> =pe1  OR  pe2          = <BR>
In execution mode, equivalent to the alternation =pe1 | pe2=.
In the other modes, attempts to make the
disjunction of the two expressions true or false,
depending on the current goal.
<LI> =NOT  pe          = <BR>
In execution mode, attempts to execute =pe=;
if that fails, it succeeds, and vice versa
(similar to Prolog's =not=).
In the other modes, attempts =pe= with the negation of the current goal
(a real logical =not=).
<LI> =pe1  IMP  pe2          = <BR>
Equivalent to =NOT pe1  OR  pe2=.
<LI> =pe1  IFF  pe2          = <BR>
Equivalent to =(pe1 IMP pe2) AND (pe2 IMP pe1)=.
</OL>

There are no primitives specific to Boolean algebra which rely on the ordering of disjuncts, other than those already described in the previous section.

There appears to be very little in the literature on the relationship between Boolean algebra and regular algebra.

** Discrete event primitives

The next primitives are applicable to any system in which there are discrete events (as opposed to continuous gradual changes).  For nets, an event is the firing of a transition.  The concepts do not presuppose an accessible state.

<OL>
<LI> =Tid          = <BR>
In execution mode, attempts to fire transition =Tid=.
The attempt will succeed if
1) at each input place there are enough tokens to be destroyed, and
2) at each output place there are enough vacancies for tokens to be created,
and
3) if there are action paths, the paths succeed.
The destruction and creation of tokens follows the order of
the declaration of the arcs.
The effects of the firing will be undone on backtracking.
In verification mode, attempts to create a non-empty
intersection of the current hypermarkings of the places
with those markings that would enable the transition to fire;
but it does not fire the transition. Undone on backtracking.
In possibility mode, tests whether there is a non-empty
intersection of the current hypermarkings of the places
with those markings that would enable the transition to fire.
<LI> =NET          = <BR>
Equivalent to the disjunction of all the transitions.
Thus if a net has transitions =a= =b= =c=,
which have been declared in that order,
then =NET= means the same as =a | b | c=.
<LI> =LEN  n          = <BR>
Equivalent to
=TIMES n NET=.
<LI> =DEADLOCK          = <BR>
Attempts to find a marking which does not allow any transitions
to fire.
Equivalent to =VERIFY NOT NET=.
Thus if a net has transitions =a= =b= =c=,
which have been declared in that order,
then  =DEADLOCK= means the same as =VERIFY NOT (a OR b OR c)=.
May produce zero or one or several solutions.
<LI> =UNREACHABLE          = <BR>
Attempts to find a marking which cannot be the
effect of any transition firings (opposite of =DEADLOCK=).
May produce zero or one or several solutions.
</OL>

The next few primitives specifically rely on the fact that a path has a beginning, and hence that every event has an ordinal position.  (Note that this need not be true of actual systems, which might have been running forever.)

<OL>
<LI> =POSITION  n          = <BR>
Succeeds if exactly =n= transitions have been fired,
otherwise fails.
<LI> =TAB  n          = <BR>
Attempts to fire as many transitions as are needed to make
the path contain exactly =n= transitions.
<LI> =MAXLENGTH  n          = <BR>
Sets the maximum pathlength to =n=.
If the limit has been reached, any attempt to fire a transition
will fail.
Always succeeds,
undone on backtracking.
Normally used only at the beginning of a path expression.
</OL>

The last primitive of this section deal with output of the path for inspection by the system designer.  Note that the designer has adequate control over what will be printed, and does not have to see paths that are deemed irrelevant.

<OL>
<LI> =SHOW_PATH          = <BR>
Causes the path to be printed.
As many transition identifiers as can be fitted onto a line
of 60 characters will be printed;
as many such lines as necessary are printed to complete the path.
The printout is preceded by =path n:=, where n is the
ordinal number of the path.
Always succeeds.
</OL>

** State primitives

The next few primitives are applicable to any system in which there is a global state which is accessible to inspection and modification.  It is possible to save the current state, to restore the state to what it was when saved, and to compare the current state with what it was when saved.  In this prototype verifier, saved states are referenced by a small number (n = 1,2..).  (In a more mature version it might be preferred to use identifiers.)  The total number of different states that can be saved depends on the number of places in the net, and on a system dependent constant.  As yet there is no check for n out of bounds.

<OL>
<LI> =SAVE  n          = <BR>
Saves the current state of the net in a save-state numbered =n=.
Always succeeds, is not undone on backtracking.
<LI> =RESTORE  n          = <BR>
Restores the current state to what it was when saved in save-state =n=.
Always succeeds, is not undone on backtracking.
<LI> =SAMESTATE  n          = <BR>
Compares the current state with the one saved in save-state =n=.
Succeeds if the two are identical.
</OL>

In systems in which the state is a set of states of a simulated system, a few simple set theoretic concepts are applicable:

<OL>
<LI> =NEWSTATE          = <BR>
Makes the current state set universal.
Always succeeds, the effects are not undone on backtracking.
<LI> =SUBSTATE n          = <BR>
Succeeds if the current state set is a subset of save-set =n=.
<LI> =SUPERSTATE n          = <BR>
Succeeds if the current state set is a superset of save-set =n=.
</OL>

