20-petri-net-verifier.html
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Primitives from Boolean algebra</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The following concepts are dependent on the current mode.  In execution mode they are independent of the current goal; in the other modes they are only dependent on the goal.
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; =TRUE          = &lt;BR&gt;
In execution mode, always succeeds.
In the other modes, succeeds if the goal is <code>true</code>.
&lt;LI&gt; =FALSE          = &lt;BR&gt;
In execution mode, always fails.
In the other modes, succeeds if the goal is <code>false</code>.
&lt;LI&gt; <code>Lid          = &lt;BR&gt;
In execution mode, attempts to make the logical variable =Lid</code>
true.
In the other modes, attempts to give <code>Lid</code>
the value of the current goal.
&lt;LI&gt; <code>pe1  AND  pe2          = &lt;BR&gt;
In execution mode, equivalent to the composition =pe1  pe2</code>.
In the other modes, attempts to make the
conjunction of the two expressions true or false,
depending on the current goal.
&lt;LI&gt; <code>pe1  OR  pe2          = &lt;BR&gt;
In execution mode, equivalent to the alternation =pe1 | pe2</code>.
In the other modes, attempts to make the
disjunction of the two expressions true or false,
depending on the current goal.
&lt;LI&gt; <code>NOT  pe          = &lt;BR&gt;
In execution mode, attempts to execute =pe</code>;
if that fails, it succeeds, and vice versa
(similar to Prolog's <code>not</code>).
In the other modes, attempts <code>pe</code> with the negation of the current goal
(a real logical <code>not</code>).
&lt;LI&gt; <code>pe1  IMP  pe2          = &lt;BR&gt;
Equivalent to =NOT pe1  OR  pe2</code>.
&lt;LI&gt; <code>pe1  IFF  pe2          = &lt;BR&gt;
Equivalent to =(pe1 IMP pe2) AND (pe2 IMP pe1)</code>.
&lt;/OL&gt;
</p>

<p>
There are no primitives specific to Boolean algebra which rely on the ordering of disjuncts, other than those already described in the previous section.
</p>

<p>
There appears to be very little in the literature on the relationship between Boolean algebra and regular algebra.
</p>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Discrete event primitives</h3>
<div class="outline-text-3" id="text-4-5">
<p>
The next primitives are applicable to any system in which there are discrete events (as opposed to continuous gradual changes).  For nets, an event is the firing of a transition.  The concepts do not presuppose an accessible state.
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; <code>Tid          = &lt;BR&gt;
In execution mode, attempts to fire transition =Tid</code>.
The attempt will succeed if
</p>
<ol class="org-ol">
<li>at each input place there are enough tokens to be destroyed, and
</li>
<li>at each output place there are enough vacancies for tokens to be created,
</li>
</ol>
<p>
and
</p>
<ol class="org-ol">
<li>if there are action paths, the paths succeed.
</li>
</ol>
<p>
The destruction and creation of tokens follows the order of
the declaration of the arcs.
The effects of the firing will be undone on backtracking.
In verification mode, attempts to create a non-empty
intersection of the current hypermarkings of the places
with those markings that would enable the transition to fire;
but it does not fire the transition. Undone on backtracking.
In possibility mode, tests whether there is a non-empty
intersection of the current hypermarkings of the places
with those markings that would enable the transition to fire.
&lt;LI&gt; =NET          = &lt;BR&gt;
Equivalent to the disjunction of all the transitions.
Thus if a net has transitions <code>a</code> <code>b</code> <code>c</code>,
which have been declared in that order,
then <code>NET</code> means the same as <code>a | b | c</code>.
&lt;LI&gt; =LEN  n          = &lt;BR&gt;
Equivalent to
<code>TIMES n NET</code>.
&lt;LI&gt; =DEADLOCK          = &lt;BR&gt;
Attempts to find a marking which does not allow any transitions
to fire.
Equivalent to <code>VERIFY NOT NET</code>.
Thus if a net has transitions <code>a</code> <code>b</code> <code>c</code>,
which have been declared in that order,
then  <code>DEADLOCK</code> means the same as <code>VERIFY NOT (a OR b OR c)</code>.
May produce zero or one or several solutions.
&lt;LI&gt; =UNREACHABLE          = &lt;BR&gt;
Attempts to find a marking which cannot be the
effect of any transition firings (opposite of <code>DEADLOCK</code>).
May produce zero or one or several solutions.
&lt;/OL&gt;
</p>

<p>
The next few primitives specifically rely on the fact that a path has a beginning, and hence that every event has an ordinal position.  (Note that this need not be true of actual systems, which might have been running forever.)
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; <code>POSITION  n          = &lt;BR&gt;
Succeeds if exactly =n</code> transitions have been fired,
otherwise fails.
&lt;LI&gt; =TAB  n          = &lt;BR&gt;
Attempts to fire as many transitions as are needed to make
the path contain exactly <code>n</code> transitions.
&lt;LI&gt; <code>MAXLENGTH  n          = &lt;BR&gt;
Sets the maximum pathlength to =n</code>.
If the limit has been reached, any attempt to fire a transition
will fail.
Always succeeds,
undone on backtracking.
Normally used only at the beginning of a path expression.
&lt;/OL&gt;
</p>

<p>
The last primitive of this section deal with output of the path for inspection by the system designer.  Note that the designer has adequate control over what will be printed, and does not have to see paths that are deemed irrelevant.
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; =SHOW<sub>PATH</sub>          = &lt;BR&gt;
Causes the path to be printed.
As many transition identifiers as can be fitted onto a line
of 60 characters will be printed;
as many such lines as necessary are printed to complete the path.
The printout is preceded by <code>path n:</code>, where n is the
ordinal number of the path.
Always succeeds.
&lt;/OL&gt;
</p>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> State primitives</h3>
<div class="outline-text-3" id="text-4-6">
<p>
The next few primitives are applicable to any system in which there is a global state which is accessible to inspection and modification.  It is possible to save the current state, to restore the state to what it was when saved, and to compare the current state with what it was when saved.  In this prototype verifier, saved states are referenced by a small number (n = 1,2..).  (In a more mature version it might be preferred to use identifiers.)  The total number of different states that can be saved depends on the number of places in the net, and on a system dependent constant.  As yet there is no check for n out of bounds.
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; <code>SAVE  n          = &lt;BR&gt;
Saves the current state of the net in a save-state numbered =n</code>.
Always succeeds, is not undone on backtracking.
&lt;LI&gt; <code>RESTORE  n          = &lt;BR&gt;
Restores the current state to what it was when saved in save-state =n</code>.
Always succeeds, is not undone on backtracking.
&lt;LI&gt; <code>SAMESTATE  n          = &lt;BR&gt;
Compares the current state with the one saved in save-state =n</code>.
Succeeds if the two are identical.
&lt;/OL&gt;
</p>

<p>
In systems in which the state is a set of states of a simulated system, a few simple set theoretic concepts are applicable:
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; =NEWSTATE          = &lt;BR&gt;
Makes the current state set universal.
Always succeeds, the effects are not undone on backtracking.
&lt;LI&gt; <code>SUBSTATE n          = &lt;BR&gt;
Succeeds if the current state set is a subset of save-set =n</code>.
&lt;LI&gt; <code>SUPERSTATE n          = &lt;BR&gt;
Succeeds if the current state set is a superset of save-set =n</code>.
&lt;/OL&gt;
</p>
</div>
</div>
