text/20-petri-net-verifier.org
** Place primitives

In a net the state is essentially a record of all the places; only the last few concepts make explicit use of this.

<OL>
<LI> =SET  Pid  n1  n2  ..          = <BR>
Attempts to intersect the current hypermarking of place =Pid=
with the disjunction of markings given by the numbers.
Normally used only at the beginning of a path expression.
<LI> =ATLEAST Pid n          = <BR>
Succeeds if place =Pid= contains at least =n= tokens.
<LI> =ATMOST Pid n          = <BR>
Succeeds if place =Pid= contains at most =n= tokens.
<LI> =EMPTY Pid          = <BR>
Succeeds if place =Pid= is empty; equivalent to =ATMOST Pid 0=.
<LI> =SHOW_MARKINGS          = <BR>
Causes the markings of the places to be printed,
always succeeds.
For each place whose current hypermarking is non-trivial,
one line is printed containing the identifier which names the place,
followed by one or more numerals denoting its current (hyper)marking.
If the current (hyper)marking contains no information
about the place, no line is printed.
For the purposes of this command,
=LOGICAL= variables are treated just like places,
except that their values are written as Booleans.
</OL>


