20-petri-net-verifier.html
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Place primitives</h3>
<div class="outline-text-3" id="text-4-7">
<p>
In a net the state is essentially a record of all the places; only the last few concepts make explicit use of this.
</p>

<p>
&lt;OL&gt;
&lt;LI&gt; <code>SET  Pid  n1  n2  ..          = &lt;BR&gt;
Attempts to intersect the current hypermarking of place =Pid</code>
with the disjunction of markings given by the numbers.
Normally used only at the beginning of a path expression.
&lt;LI&gt; <code>ATLEAST Pid n          = &lt;BR&gt;
Succeeds if place =Pid</code> contains at least <code>n</code> tokens.
&lt;LI&gt; <code>ATMOST Pid n          = &lt;BR&gt;
Succeeds if place =Pid</code> contains at most <code>n</code> tokens.
&lt;LI&gt; <code>EMPTY Pid          = &lt;BR&gt;
Succeeds if place =Pid</code> is empty; equivalent to <code>ATMOST Pid 0</code>.
&lt;LI&gt; =SHOW<sub>MARKINGS</sub>          = &lt;BR&gt;
Causes the markings of the places to be printed,
always succeeds.
For each place whose current hypermarking is non-trivial,
one line is printed containing the identifier which names the place,
followed by one or more numerals denoting its current (hyper)marking.
If the current (hyper)marking contains no information
about the place, no line is printed.
For the purposes of this command,
<code>LOGICAL</code> variables are treated just like places,
except that their values are written as Booleans.
&lt;/OL&gt;

</p>
</div>
</div>
</div>
