20-petri-net-verifier.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Examples</h2>
<div class="outline-text-2" id="text-5">
<p>
The following examples have been chosen to be brief.  They consist of echoed input to Netver and output from Netver.  Lines with a line number are echoed input, the line number is supplied by Netver; lines without a line number are output from Netver.  All examples are from a short principal input file and two longer subsidiary files that were included.
</p>

<pre class="example">
   1    %LISTING 1
   2    (*  BEGIN OF DEMONSTRATION FILE FOR NETVER *)
   3
   4    %SET A = 1 (* PRELIMINARIES *)
   5    %SET B = 1 (* SEVERAL NETS *)
   6
   7    %IF A %INCLUDE 45PRELIM.NV
   1    (* BEGIN OF PRELIMINARY DEMONSTRATIONS *)
   2
   3    (* PATH EXPRESSIONS *)
   4
   5    PATH
   6        (SKIP | SKIP)
   7        (FAIL | SKIP | SKIP SKIP FAIL)
   8        (SKIP | FAIL | SKIP)
   9        SHOW_PATH   (* expecting four (empty) paths *);
        path 1:
        path 2:
        path 3:
        path 4:
  10    PATH
  11        VERIFY(
  12          (TRUE OR FALSE) AND
  13          NOT(FALSE OR FALSE) AND
  14          (TRUE OR TRUE))
  15        SHOW_PATH   (* expecting two (empty) paths *);
        path 1:
        path 2:
  16    PATH
  17        (SKIP SKIP FAIL | SKIP FENCE FAIL | SKIP)
  18        SHOW_PATH   (* expecting no paths at all *).
  19
  20    (* DECLARATIONS *)
  21
  22    PRODUCTION
  23        (* Note: uses before declarations are permitted *)
  24        one  ::=  (f | s | f) (f | s);
  25        sixteen  ::=  four four;
  26        four  ::=  (s | s | s | s);
  27        s  ::=  SKIP;
  28        f  ::=  FAIL;
  29        show  ::= SHOW_PATH;
  30    PATH
  31        (one | one) show (* expecting two (empty) paths *);
        path 1:
        path 2:
  32    PATH
  33        SHOW_TOTAL  sixteen sixteen (* expecting 256 *).
        total number of paths: 256
  34
  35    (* LOGICAL variables *)
  36
  37    LOGICAL p,q,r,s;
  38    PATH                            (* faulty dilemma *)
  39        SHOW_TOTAL
  40        VERIFY NOT                  (*   try to falsify *)
  41            ( ( (p OR  q) AND       (*       premise 1 *)
  42                (p IMP r) AND       (*       premise 2 *)
  43                (q IMP s) )         (*       premise 3 *)
  44            IMP (r AND s) )         (*       conclusion *)
  45        SHOW_MARKINGS               (* expecting two solutions *);
        mark 1:
                p TRUE
                q FALSE
                r TRUE
                s FALSE
        mark 2:
                p FALSE
                q TRUE
                r FALSE
                s TRUE
        total number of paths: 2
  46    PATH                            (* correct dilemma *)
  47        SHOW_TOTAL
  48        VERIFY NOT                  (*   try to falsify *)
  49            ( ( (p OR  q) AND       (*       premise 1 *)
  50                (p IMP r) AND       (*       premise 2 *)
  51                (q IMP s) )         (*       premise 3 *)
  52            IMP (r OR s) )          (*       conclusion *)
  53        SHOW_MARKINGS               (* expecting no solutions *)
  54                                    (* since this is valid *);
        total number of paths: 0
  55    PATH
  56        SHOW_TOTAL          (* just show the number *)
  57        (SKIP | SKIP)
  58        (SKIP | SKIP)
  59        (SKIP | SKIP)       (* total of 8 expected *);
        total number of paths: 8
  60    PATH                    (* same pattern, but using LOGICALs *)
  61        SHOW_TOTAL          (* to block some of the 8 paths *)
  62        (SKIP  VERIFY p      |  SKIP  VERIFY NOT q)
  63        (SKIP  VERIFY NOT p  |  SKIP  VERIFY r)
  64        (SKIP  VERIFY NOT r  |  SKIP  VERIFY (r AND p)).
        total number of paths: 3
  65
  66    (* TRANSITIONS *)
  67
  68    TRANSITION
  69      alpha, beta, gamma;
  70    PATH
  71      alpha  NET  SHOW_PATH    (* expecting 3 paths *).
        path 1:
        alpha alpha
        path 2:
        alpha beta
        path 3:
        alpha gamma
  72
  73    (* LONG PATH WITH SHORT NAMES *)
  74
  75    TRANSITION
  76        g0, c, d, e, f, g;
  77    PRODUCTION
  78        theme1 ::= e e f g g f e d c c d e;
  79        theme2 ::= e d d;
  80        theme3 ::= d c c;
  81        theme4 ::= d d e c d e f e c d e f e d c d g0;
  82        beethoven ::=
  83          theme1 theme2 theme1 theme3 theme4 theme1 theme3;
  84        plagiarist ::=
  85          theme3 theme2 theme1 theme4 theme1;
  86    PATH
  87        (beethoven | plagiarist)  SHOW_PATH.
        path 1:
        e e f g g f e d c c d e e d d e e f g g f e d c c d e d c c
        d d e c d e f e c d e f e d c d g0 e e f g g f e d c c d e d
        c c
        path 2:
        d c c e d d e e f g g f e d c c d e d d e c d e f e c d e f
        e d c d g0 e e f g g f e d c c d e
  88
  89    (* LIMITING OUTPUT *)
  90
  91    TRANSITION
  92        alpha, beta, gamma, delta;
  93    PATH
  94        SHOW_TOTAL                  (* total number of paths *)
  95        LEN 3                       (* fire any 3 transitions *)
  96        NEWSCOPE
  97          ( PATHNUM 42  SHOW_PATH  FENCE    (* show 42nd path *)
  98            | SKIP )                        (* but not others *).
        path 42:
        gamma gamma beta
        total number of paths: 64
  99
 100    (* PLACES to ensure every transition fires at most once *)
 101
 102    PLACE
 103        a, b, g, d, e, z;
 104    TRANSITION
 105        alpha INARC a;      beta INARC b;           gamma INARC g;
 106        delta INARC d;      epsilon INARC e;        zeta INARC z;
 107    PATH
 108        SHOW_TOTAL  LEN 6
 109        NEWSCOPE
 110         (PATHNUM 42  SHOW_PATH  SHOW_MARKINGS  FENCE  |  SKIP).
        path 42:
        alpha gamma epsilon zeta delta beta
        mark 42:
                a 0
                b 0
                g 0
                d 0
                e 0
                z 0
        total number of paths: 720
 111
 112    (* ONE PRODUCER - TWO CONSUMERS *)
 113
 114    PLACE
 115        buffer, producing, consuming1, consuming2;
 116    TRANSITION
 117        produce     OUTARC producing;
 118        deposit     INARC producing OUTARC buffer;
 119        remove1     INARC buffer OUTARC consuming1;
 120        consume1    INARC consuming1;
 121        remove2     INARC buffer OUTARC consuming2;
 122        consume2    INARC consuming2;
 123    PRODUCTION
 124        initialise ::=
 125            SET buffer 0  SET producing 0
 126            SET consuming1 0  SET consuming2 0;
 127    PATH
 128        SHOW_TOTAL DEADLOCK SHOW_MARKINGS
 129        (* no deadlock expected *);
        total number of paths: 0
 130    PATH
 131        SHOW_TOTAL UNREACHABLE SHOW_MARKINGS
 132        (* no unreachable marking expected *);
        total number of paths: 0
 133    PATH (* find cycles from the given initialisation *)
 134        initialise  MAXLENGTH 7
 135        SAVE 1  POS NET  SAMESTATE 1  SHOW_PATH.
        path 1:
        produce deposit remove1 consume1
        path 2:
        produce deposit remove2 consume2
 136
 137    (* END OF PRELIMINARY DEMONSTRATIONS *)
   8
   9    %IF B %INCLUDE 45NETNET.NV
   1    (* BEGIN NET DEMONSTRATIONS *)
   2
   3    (* BARBER SHOP -
   4            adapted from a graphical presentation in
   5       Filman, R.E. and Friedman, D.P., 1984,
   6            Coordinated Computing, McGraw-Hill, pp 107-109. *)
   7    PLACE
   8        waiting, exiting 12;        (* size of waiting room *)
   9        idle 7;                     (* size of barbers' tea room *)
  10        cutting 5;                  (* number of chairs *)
  11    TRANSITION
  12        new_customer        OUTARC waiting;
  13        start_cutting       INARC waiting, idle; OUTARC cutting;
  14        finish_cutting      INARC cutting; OUTARC idle, exiting;
  15        leave_shop          INARC exiting;
  16    PATH
  17        DEADLOCK SHOW_MARKINGS
  18        (* too few  or too many barbers : *);
        mark 1:
                waiting 12
                exiting 0
                idle 0
                cutting 0
        mark 2:
                waiting 12
                exiting 0
                idle 7
                cutting 5
  19    PATH    (* find just one cycle *)
  20        SET waiting 0  SET idle 7  SET cutting 0  SET exiting 0
  21        MAXLENGTH 8
  22        SAVE 1  POS NET  SAMESTATE 1  SHOW_PATH  ABORT.
        path 1:
        new_customer new_customer start_cutting start_cutting
        finish_cutting finish_cutting leave_shop leave_shop
  23
  24    (* MUTUAL EXCLUSION -
  25            adapted from a graphical presentation in
  26       Filman, R.E. and Friedman, D.P., 1984,
  27            Coordinated Computing, McGraw-Hill, pp 110-111. *)
  28    PLACE
  29      concur1,concur2,concur3, none_critical,
  30      critical1,critical2,critical3;
  31    TRANSITION
  32      enter1 INARC concur1,none_critical; OUTARC critical1;
  33      leave1 INARC critical1; OUTARC concur1,none_critical;
  34      enter2 INARC concur2,none_critical; OUTARC critical2;
  35      leave2 INARC critical2; OUTARC concur2,none_critical;
  36      enter3 INARC concur3,none_critical; OUTARC critical3;
  37      leave3 INARC critical3; OUTARC concur3,none_critical;
  38    PATH
  39      SHOW_TOTAL  DEADLOCK
  40      (* too many to look at, just show two: *)
  41      OPT ( (PATHNUM 42 | PATHNUM 73) SHOW_MARKINGS FAIL )
  42      (* the FAIL stops two paths being counted twice in total *);
        mark 42:
                concur1 0
                concur3 0
                none_critical 1
                critical2 1
                critical3 0
        mark 73:
                concur1 1
                concur2 1
                concur3 1
                none_critical 0
                critical3 1
        total number of paths: 120
  43
  44    PATH
  45      SET concur1 1  SET concur2 1  SET concur3 1
  46      SET none_critical 1
  47      SET critical1 0  SET critical2 0  SET critical3 0
  48      MAXLENGTH 10  MAXPATHS 3  TIMES 6 NET  SHOW_PATH.
        path 1:
        enter1 leave1 enter1 leave1 enter1 leave1
        path 2:
        enter1 leave1 enter1 leave1 enter2 leave2
        path 3:
        enter1 leave1 enter1 leave1 enter3 leave3
  49
  50    (* READERS(3) AND WRITERS(1) -
  51            adapted from a graphical presentation in
  52       Filman, R.E. and Friedman, D.P., 1984,
  53            Coordinated Computing, McGraw-Hill, pp 113-114. *)
  54
  55    (* first, the net itself: *)
  56
  57    PLACE
  58        write, not_write : 1;
  59        free_read : 3;
  60        read1, not_read1 : 1;
  61        read2, not_read2 : 1;
  62        read3, not_read3 : 1;
  63    TRANSITION
  64        start_write
  65          INARC not_write INARC free_read 3; OUTARC write;
  66        stop_write
  67          INARC write; OUTARC not_write OUTARC free_read 3;
  68        start_read1
  69          INARC not_read1,free_read; OUTARC read1;
  70        start_read2
  71          INARC not_read2,free_read; OUTARC read2;
  72        start_read3
  73          INARC not_read3,free_read; OUTARC read3;
  74        stop_read1
  75          INARC read1; OUTARC not_read1,free_read;
  76        stop_read2
  77          INARC read2; OUTARC not_read2,free_read;
  78        stop_read3
  79          INARC read3; OUTARC not_read3,free_read;
  80
  81    (* second, some tools for analysing the net: *)
  82
  83    LOGICAL
  84        do_read1, do_read2, do_read3;
  85    PRODUCTION
  86        show  ::=
  87            SHOW_PATH  SHOW_MARKINGS;
  88        start_any_read  ::=
  89            start_read1 | start_read2 | start_read3;
  90        stop_any_read  ::=
  91            stop_read1 | stop_read2 | stop_read3;
  92        initialise ::=
  93            SET not_read1 1  SET not_read2 1  SET not_read3 1
  94            SET read1 0  SET read2 0  SET read3 0
  95            SET not_write 1  SET write 0;
  96        v1  ::=  VERIFY do_read1;    f1  ::=  VERIFY NOT do_read1;
  97        v2  ::=  VERIFY do_read2;    f2  ::=  VERIFY NOT do_read2;
  98        v3  ::=  VERIFY do_read3;    f3  ::=  VERIFY NOT do_read3;
  99    PATH
 100        SHOW_TOTAL  initialise  LEN 4;
        total number of paths: 94
 101    PATH
 102        SHOW_TOTAL  initialise  LEN 4  OPT(PATHNUM 42 show ABORT);
        path 42:
        start_read2 start_read1 start_read3 stop_read3
        mark 42:
                write 0
                not_write 1
                free_read 1
                read1 1
                not_read1 0
                read2 1
                not_read2 0
                read3 0
                not_read3 1
        total number of paths: 41
 103    PATH
 104        initialise   MAXPATHS 6   LEN 4   SHOW_PATH;
        path 1:
        start_write stop_write start_write stop_write
        path 2:
        start_write stop_write start_read1 start_read2
        path 3:
        start_write stop_write start_read1 start_read3
        path 4:
        start_write stop_write start_read1 stop_read1
        path 5:
        start_write stop_write start_read2 start_read1
        path 6:
        start_write stop_write start_read2 start_read3
 105    PATH
 106        (* NOTE: no initialisation *)
 107        SHOW_TOTAL DEADLOCK (* far too many to print out *);
        total number of paths: 504
 108    PATH
 109        SHOW_TOTAL start_write start_any_read show
 110        (* none, we hope ! *);
        total number of paths: 0
 111    PATH
 112        SHOW_TOTAL start_any_read start_write show
 113        (* none, we hope ! *);
        total number of paths: 0
 114    PATH
 115        initialise
 116        ( start_read1 v1 f2 f3 |
 117          start_read2 f1 v2 f3 |
 118          start_read3 f1 f2 v3 )
 119        NET  start_write   (v1 | v2 | v3 NET)  show.
        path 1:
        start_read1 stop_read1 start_write
        mark 1:
                write 1
                not_write 0
                free_read 0
                read1 0
                not_read1 1
                read2 0
                not_read2 1
                read3 0
                not_read3 1
                do_read1 TRUE
                do_read2 FALSE
                do_read3 FALSE
        path 2:
        start_read2 stop_read2 start_write
        mark 2:
                write 1
                not_write 0
                free_read 0
                read1 0
                not_read1 1
                read2 0
                not_read2 1
                read3 0
                not_read3 1
                do_read1 FALSE
                do_read2 TRUE
                do_read3 FALSE
        path 3:
        start_read3 stop_read3 start_write stop_write
        mark 3:
                write 0
                not_write 1
                free_read 3
                read1 0
                not_read1 1
                read2 0
                not_read2 1
                read3 0
                not_read3 1
                do_read1 FALSE
                do_read2 FALSE
                do_read3 TRUE
 120
 121    (* END NET DEMONSTRATIONS *)
  10
  11    (*  END OF DEMONSTRATION FILE FOR NETVER *)
  12    QUIT
4920 milliseconds CPU
</pre>
</div>
</div>
