text/20-petri-net-verifier.org
* Implementation

Like most other programs in this book, the system consists of a small compiler which translates the source code to an internal form, and an interpreter for executing the internal form.  Only a cursory description will be given.

* /Compilation/:
The compiler uses recursive descent in an entirely conventional manner.  It consists of a scanner, a parser and a codegenerator.

The scanner, taken from the utilities in Chapter 17, handles numbers and reserved words in an obvious manner.  Identifiers are handled separately, in particular by a procedure which looks them up in the symbol table.  Then it reports to the parser whether the identifier has been declared already or whether it is new.

The parser is modelled on the grammar; it consists of several parsing procedures, one for each non-terminal.  The bodies of the parsing procedure contain calls to the scanner and to a code generator.

The very simple code generator produces binary trees of nodes containing an operator field and a few other fields.  The latter fields are variously integer pointers to other nodes, or they are data integers or sets of markings.  In particular, the tree for a transition consists of =AND=-nodes joining the nodes for the arcs; and the tree for the entire NET consists of =OR=-nodes joining the nodes of all transitions.

* /Interpretation/:
The internal form of the code is then passed to an interpreter.  The interpreter consists of a recursive procedure which takes a node as a parameter; a case statement then dispatches on the operator field of the node.  To implement backtracking, the recursive procedure has another parameter which is a (parameterless) procedure.  This other procedure acts as a continuation which will be called just in case the interpretation of the current node succeeds --- otherwise it is ignored.

In general, to produce some atomic effect and to undo the effect on backtracking, the interpreter uses code of the following form:

#+begin_example
CASE  operator(node)  OF
        ...
        some-effect :
                IF producing the effect is possible THEN
                        produce the effect;
                        call the continuation;
                        undo the effect
        ...
#+end_example

A typical example is the node for an arc from or to a place.  The hypermarking of a place is represented by a set of small integers, the presence or absence of an integer represents a marking.  The node for, say, an input arc contains one field which is a reference to the place from which the arc comes, and another field which is a number specifying how many tokens are to be removed.  (For efficiency, there is another field representing the possible markings of the place after the firing of the transition.)  For such a node the interpreter uses the following code:

#+begin_example
        input-arc:
                IF the required number of tokens can be removed THEN
                        save the current hypermarking of the place
                        construct the new hypermarking
                        call the continuation
                        restore the saved hypermarking of the place
#+end_example

The interpreter code for non-atomic nodes typically call the interpreter recursively, passing as continuation parameters local procedures.  Typically the local procedure will either call or pass as a parameter the original continuation.  So most of these local procedures are never called directly, but only as continuations.  When they are called in this indirect manner, they perform some work in the environment of their definition including a call to the original continuation.

The initial call of the interpreter uses as one actual parameter the tree for the path expression that was last read.  The other actual parameter is a global procedure which almost does nothing at all --- it merely increments the counter for the number of successful paths.


