text/20-petri-net-verifier.org
* The program

The following is the source:

#+begin_src pascal
PROGRAM netver(input,output);

LABEL 10,90,99;

CONST
    errormark = '%NV';
    list_filename = '45netver.lst';
    reslength = 16; emptyres = '                ';
    maxrestab = 70;
    identlength = 16; emptyident = '                ';
    maxstdidenttab = 1; (* dummy *)

TYPE
    symbol =
        (place_id,transition_id,nonterminal_id,logical_id,
         new_id,identifier,
        (* no more idents after here *)
         true_op,false_op,
         net_op,skip_op,fail_op,abort_op,quit_op,
         deadlock_op,unreachable_op,fence_op,set_op,showtotpathnum_op,
         empty_op,atleast_op,atmost_op,newstate_op,
         show_path_op,show_markings_op,arc_op,trans_op,nonterm_op,
         logical_op,
         execute_op,verify_op,possibly_op,
         opt_op,pos_op,rep_op,timmes_op,not_op,newscope_op,
         len_op,maxlength_op,maxpaths_op,position_op,tab_op,
         pathnum_op,
         save_op,restore_op,samestate_op,substate_op,superstate_op,
         leftparenthesis,
        (* no more  facbegsys after here *)
         and_op, (* must be here, see TERM *)
         cat_op,or_op,imp_op,iff_op,alt_op,
         rightparenthesis_,
         comma_,period_,colon_,bnfarrow_,semicol_,queery_,
         end_,inarc_,outarc_,action_,
         path_,place_,production_,transition_,logical_,
        (* compulsory for scanutilities: *)
         charconst,stringconst,numberconst,hyphen);
    standardident = (dummy);

%INCLUDE '41SCANUT.PAS'

PROCEDURE initialise;
VAR i : integer;
BEGIN (* initialise *)
iniscanner;
specials_repeat := [':','='];
erw(')               ',rightparenthesis_);
erw(',               ',comma_);
erw('.               ',period_);
erw(':               ',colon_);
erw('::=             ',bnfarrow_);
erw(';               ',semicol_);
erw('?               ',queery_);
erw('ABORT           ',abort_op);
erw('ACTION          ',action_);
erw('ALT             ',alt_op);
erw('AND             ',and_op);
erw('ATLEAST         ',atleast_op);
erw('ATMOST          ',atmost_op);
erw('DEADLOCK        ',deadlock_op);
erw('EMPTY           ',empty_op);
erw('END             ',end_);
erw('EXECUTE         ',execute_op);
erw('FAIL            ',fail_op);
erw('FALSE           ',false_op);
erw('FENCE           ',fence_op);
erw('IFF             ',iff_op);
erw('IMP             ',imp_op);
erw('INARC           ',inarc_);
erw('LEN             ',len_op);
erw('LOGICAL         ',logical_);
erw('MAXLENGTH       ',maxlength_op);
erw('MAXPATHS        ',maxpaths_op);
erw('NET             ',net_op);
erw('NEWSCOPE        ',newscope_op);
erw('NEWSTATE        ',newstate_op);
erw('NOT             ',not_op);
erw('OPT             ',opt_op);
erw('OR              ',or_op);
erw('OUTARC          ',outarc_);
erw('PATH            ',path_);
erw('PATHNUM         ',pathnum_op);
erw('PLACE           ',place_);
erw('POS             ',pos_op);
erw('POSITION        ',position_op);
erw('POSSIBLY        ',possibly_op);
erw('PRODUCTION      ',production_);
erw('QUIT            ',quit_op);
erw('REP             ',rep_op);
erw('RESTORE         ',restore_op);
erw('SAMESTATE       ',samestate_op);
erw('SAVE            ',save_op);
erw('SET             ',set_op);
erw('SHOW_MARKINGS   ',show_markings_op);
erw('SHOW_PATH       ',show_path_op);
erw('SHOW_TOTAL      ',showtotpathnum_op);
erw('SKIP            ',skip_op);
erw('SUBSTATE        ',substate_op);
erw('SUPERSTATE      ',superstate_op);
erw('TAB             ',tab_op);
erw('TIMES           ',timmes_op);
erw('TRANSITION      ',transition_);
erw('TRUE            ',true_op);
erw('UNREACHABLE     ',unreachable_op);
erw('VERIFY          ',verify_op);
erw('|               ',alt_op);
END; (* initialise *)

CONST
    interactive_usage = false;
    maxplaces = 50;
    maxsaves = 200;
    maxsymtab = 100;
    maxcode = 1000;
    maxpathlength = 100;
    maxcapacity = 31;
TYPE
    operator = net_op .. or_op;
    markset = SET OF 0 .. maxcapacity;
VAR
    symtab : ARRAY [0 .. maxsymtab] OF (* 0 for sentinel *)
        RECORD
            alf : identalfa;
            obj : symbol;
            val : integer
            END;
    lastsymtab,location : integer;
    new_id_allowed : boolean;
    code : ARRAY [1 .. maxcode] OF RECORD
                op : operator; left, right : integer;
                arc_opset : markset;
                END;
    codeindex, headnode, last_block_code : integer;
    place : ARRAY [1 .. maxplaces] OF RECORD
                symtab_ptr, capacity : integer;
                pl_poss, pl_cur : markset
                END;
    lastplace : integer;
    saves : ARRAY [1..maxsaves] OF markset;
    path : ARRAY [1..maxpathlength] OF integer;
    pathlength,maxlength : integer;
    pathnum,maxpaths : integer;
    fenced,showtotpathnum : boolean;
    mode : symbol; goal : boolean;
    i,j : integer;

(* - - - - -   U T I L I T I E S   - - - - - *)

PROCEDURE lookup;
BEGIN (* lookup *)
symtab[0].alf := ident; location := lastsymtab;
WHILE symtab[location].alf <> ident DO location := location - 1;
IF location = 0 THEN
    BEGIN
    lastsymtab := lastsymtab + 1;
    WITH symtab[lastsymtab] DO
        BEGIN alf := ident; obj := new_id; val := 0 END;
    location := lastsymtab;
    END;
WITH symtab[location] DO
    BEGIN sym := obj; num := val END
END; (* lookup *)

PROCEDURE generate(o : operator; x,y : integer);
BEGIN
codeindex := codeindex + 1;
WITH code[codeindex] DO
    BEGIN op := o; left := x; right := y END
END; (* generate *)

PROCEDURE writenode(n : integer);
BEGIN
WITH code[n] DO
    BEGIN
    IF n = headnode
        THEN write(listing,'***')
        ELSE write(listing,'   ');
    write(listing,n:4,'  ', op:16,'  ',left:6,right:6);
    CASE op OF
        arc_op :
            BEGIN
            write(listing,'   ');
            FOR j := 0 TO place[left].capacity DO
                IF j IN arc_opset THEN write(listing,j:0,' ')
            END;
        logical_op,trans_op,nonterm_op :
            write(listing,'  ',symtab[left].alf);
        END;
    writeln(listing)
    END
END; (* writenode *)

(* - - - - -   I N P U T  - - - - - *)

PROCEDURE expression;
VAR left : integer; oper : operator;

    PROCEDURE term;
    VAR left : integer; oper : operator;

        PROCEDURE factor;
        VAR oper : operator; n : integer;
        BEGIN (* factor *)
        IF sym = identifier THEN lookup;
        CASE sym OF
            new_id,nonterminal_id :
                BEGIN
                IF sym = new_id THEN
                    BEGIN
                    IF NOT new_id_allowed THEN
                        point('E','new identifier not allowed    ');
                    symtab[location].obj := nonterminal_id;
                    END;
                generate(nonterm_op,location,0 (* fixed in BLOCK *) );
                getsym
                END;
            transition_id :
                BEGIN
                generate(trans_op,location,num); getsym
                END;
            logical_id :
                BEGIN
                generate(logical_op,location,num); getsym
                END;
            net_op,skip_op,fail_op,abort_op,quit_op,
            true_op,false_op,
            deadlock_op,unreachable_op,fence_op,showtotpathnum_op,
            newstate_op,
            show_path_op,show_markings_op :
                BEGIN
                generate(sym,0,0); getsym
                END;
            execute_op,verify_op,possibly_op,newscope_op,
            not_op,opt_op,pos_op,rep_op :
                BEGIN
                oper := sym; getsym; factor;
                generate(oper,0,codeindex)
                END;
            timmes_op :
                BEGIN
                getsym;
                IF sym <> numberconst THEN
                    point('E','number expected               ');
                n := num; getsym; factor;
                generate(timmes_op,n,codeindex)
                END;
            save_op,restore_op,samestate_op,substate_op,superstate_op,
            len_op,maxlength_op,maxpaths_op,position_op,tab_op,
            pathnum_op :
                BEGIN
                oper := sym; getsym;
                IF sym <> numberconst THEN
                    point('E','number expected               ');
                generate(oper,num,0); getsym
                END;
            empty_op :
                BEGIN
                getsym;
                lookup;
                IF sym <> place_id THEN
                    point('E','place identifier expected     ');
                generate(empty_op,num,0); getsym
                END;
            atleast_op,atmost_op :
                BEGIN
                oper := sym; getsym;
                lookup;
                IF sym <> place_id THEN
                    point('E','place identifier expected     ');
                n := num; getsym;
                IF sym <> numberconst THEN
                    point('E','number expected               ');
                generate(oper,n,num); getsym
                END;
            set_op :
                BEGIN
                getsym;
                lookup;
                IF sym <> place_id THEN
                    point('E','place identifier expected     ');
                generate(set_op,num,0);
                code[codeindex].arc_opset := [];
                getsym;
                WHILE sym = numberconst DO
                    BEGIN
                    WITH code[codeindex] DO
                        arc_opset := arc_opset + [num];
                    getsym
                    END
                END;
            leftparenthesis :
                BEGIN
                getsym;
                expression;
                check(rightparenthesis_,[],
                    '")" expected                  ');
                END;
            OTHERWISE
                point('F','internal error in factor      ');
            END (* CASE *)
        END; (* factor *)

    BEGIN (* term *)
    factor;
    IF sym <= and_op THEN
        BEGIN
        left := codeindex;
        IF sym <= leftparenthesis THEN oper := cat_op ELSE
            BEGIN oper := sym; getsym END;
        term; generate(oper,left,codeindex)
        END
    END (* term *);

BEGIN (* expression *)
term;
IF sym IN [alt_op,or_op,imp_op,iff_op] THEN
    BEGIN
    left := codeindex; oper := sym; getsym;
    expression; generate(oper,left,codeindex)
    END
END (* expression *);

PROCEDURE block;

VAR
    loc, cap, toknum, i : integer;
    poss : markset;
    net_fix : integer;

    PROCEDURE arc_list;
    VAR left : integer;

        PROCEDURE onearc;
        VAR tr_declarator : symbol; i : integer;

            PROCEDURE placelist;
            VAR left : integer;

                PROCEDURE oneplace;
                BEGIN (* oneplace *)
                lookup;
                IF sym <> place_id THEN
                    point('E','place identifier expected     ')
                  ELSE
                    BEGIN generate(arc_op,num,99999); getsym END
                END; (* oneplace *)

            BEGIN (* placelist *)
            oneplace;
            IF sym = comma_ THEN
                BEGIN
                left := codeindex; getsym;
                placelist; generate(and_op,left,codeindex)
                END
            END; (* placelist *)

        BEGIN (* onearc *)
        tr_declarator := sym; getsym;
        IF tr_declarator = action_ THEN expression ELSE
            BEGIN (* arc *)
            i := codeindex; placelist;
            IF sym <> numberconst then toknum := 1 ELSE
                BEGIN toknum := num; getsym END;
            WHILE i < codeindex DO
                BEGIN (* update *)
                i := i + 1;
                WITH code[i] DO
                    IF op = arc_op THEN
                        BEGIN
                        cap := place[left].capacity;
                        IF tr_declarator = inarc_ THEN
                            BEGIN
                            arc_opset := [toknum .. cap];
                            right := - toknum
                            END
                          ELSE
                            BEGIN
                            arc_opset := [0 .. cap - toknum];
                            right := toknum
                            END
                        END (* arc_op *)
                END (* update *)
            END; (* arc *)
        IF sym = semicol_ THEN getsym;
        END; (* onearc *)

    BEGIN (* arc_list *)
    onearc;
    IF sym IN [inarc_,outarc_,action_] THEN
        BEGIN
        left := codeindex;
        arc_list; generate(and_op,left,codeindex)
        END
    END; (* arc_list *)

BEGIN (* block *)
new_id_allowed := true;
WHILE sym IN [place_,transition_,production_,logical_] DO
    CASE sym OF
        logical_ :
            BEGIN
            getsym;
            WHILE sym = identifier DO
                BEGIN
                REPEAT
                    lookup;
                    IF sym <> new_id THEN
                        point('E','new identifier expected       ');
                    lastplace := lastplace + 1;
                    WITH place[lastplace] DO
                        BEGIN
                        symtab_ptr := location; capacity := 1;
                        pl_poss := [0,1]; pl_cur := [0,1]
                        END;
                    WITH symtab[location] DO
                        BEGIN obj := logical_id; val := lastplace END;
                    getsym;
                    IF sym = comma_ THEN getsym
                    UNTIL NOT (sym <= identifier);
                IF sym = semicol_ THEN getsym
                END (* WHILE ident *)
            END; (* logical *)
        place_ :
            BEGIN
            getsym;
            WHILE sym <= identifier DO
                BEGIN
                i := lastplace;
                REPEAT
                    lookup;
                    IF sym <> new_id THEN
                        point('E','new identifier expected       ');
                    lastplace := lastplace + 1;
                    place[lastplace].symtab_ptr := location;
                    WITH symtab[location] DO
                        BEGIN obj := place_id; val := lastplace END;
                    getsym;
                    IF sym = comma_ THEN getsym
                    UNTIL NOT (sym <= identifier);
                IF sym = colon_ THEN getsym;
                IF sym <> numberconst THEN cap := 1 ELSE
                    BEGIN cap := num; getsym END;
                poss := [0 .. cap];
                WHILE i < lastplace DO
                    BEGIN (* update *)
                    i := i + 1;
                    WITH place[i] DO
                        BEGIN
                        capacity := cap;
                        pl_poss := poss;
                        pl_cur := poss
                        END
                    END; (* WHILE *)
                IF sym = semicol_ THEN getsym
                END (* WHILE ident *)
            END; (* place *)
        transition_ :
            BEGIN
            getsym;
            WHILE sym = identifier DO
                BEGIN
                loc := lastsymtab + 1;
                REPEAT
                    lookup;
                    IF sym <> new_id THEN
                        point('E','new identifier expected       ');
                    symtab[location].obj := transition_id;
                    getsym;
                    IF sym = comma_ THEN getsym
                    UNTIL NOT (sym <= identifier);
                IF sym = semicol_ THEN getsym;
                IF sym IN [inarc_,outarc_,action_]
                    THEN arc_list
                    ELSE generate(skip_op,0,0);
                WHILE loc <= lastsymtab DO
                    BEGIN
                    symtab[loc].val :=codeindex; loc := loc + 1
                    END
                END (* WHILE ident *)
            END; (* transition *)
        production_ :
            BEGIN
            getsym;
            WHILE sym = identifier DO
                BEGIN
                lookup;
                IF NOT (sym IN [new_id, nonterminal_id]) THEN
                    point('E','nonterminal expected          ');
                IF sym = new_id THEN
                    symtab[location].obj := nonterminal_id;
                loc := location; getsym;
                check(bnfarrow_,[],'"::=" expected                ');
                expression; symtab[loc].val := codeindex;
                IF sym = semicol_ THEN getsym
                END (* WHILE idents *)
            END (* production *)
        END; (* CASE *)
IF writelisting > 1 THEN
    BEGIN writeln(listing); writeln(listing,'symbol table: ') END;
net_fix := 0;
FOR i := 1 TO lastsymtab DO
    WITH symtab[i] DO
        BEGIN
        CASE obj OF
            transition_id :
                BEGIN
                generate(trans_op,i,val);
                generate(or_op,codeindex,0);
                IF headnode = 0
                    THEN headnode := codeindex
                    ELSE code[net_fix].right := codeindex;
                net_fix := codeindex;
                END;
            nonterminal_id :
                IF val = 0 THEN
                    BEGIN
                    point('E','undefined non-terminal        ');
                    putch('"'); writeident(alf); putch('"');
                    writeline; GOTO 99
                    END;
            END; (* CASE *)
        IF writelisting > 1 THEN
            writeln(i:3,' ',alf:identlength,' ',obj,' ',val)
        END; (* WITH,FOR *)
IF headnode <> 0 THEN (* delete the last "OR" for transitions *)
    BEGIN
    codeindex := codeindex - 1;
    code[codeindex - 1].right := code[codeindex + 1].left;
    END;
last_block_code := codeindex;
IF writelisting > 2 THEN
    writeln(listing,'code for this block');
FOR i := 1 TO codeindex DO
    WITH code[i] DO
        IF op = nonterm_op THEN
            BEGIN
            right := symtab[left].val; (* fixup *)
            IF writelisting > 2 THEN writenode(i)
            END
END; (* block *)

(* - - - - -  A N A L Y S I S  - - - - - *)

PROCEDURE skip;
BEGIN (* skip *)
IF pathnum = maxpaths THEN
    maxlength := -1; (* this will block further tries *)
pathnum := pathnum + 1
END; (* skip *)

PROCEDURE show_markings;
VAR i,j : integer;
BEGIN (* show_markings *)
writeident('mark            '); putch(' ');
writeinteger(pathnum); putch(':'); writeline;
FOR i := 1 TO lastplace DO
    WITH place[i] DO
        IF pl_cur <> pl_poss THEN
            BEGIN
            putch(chr(9));
            writeident(symtab[symtab_ptr].alf); putch(' ');
            FOR j := 0 TO capacity DO
                IF j IN pl_cur THEN
                    BEGIN
                    IF symtab[symtab_ptr].obj <> logical_id
                        THEN writeinteger(j)
                    ELSE IF j = 0 THEN writeident('FALSE           ')
                    ELSE writeident('TRUE            ');
                    putch(' ')
                    END;
            writeline
            END
END; (* show_markings *)

PROCEDURE show_path;
VAR i : integer;
BEGIN (* show_path *)
writeident('path            '); putch(' ');
writeinteger(pathnum); putch(':'); writeline;
FOR i := 1 TO pathlength DO
    BEGIN writeident(symtab[path[i]].alf); putch(' ') END;
IF pathlength > 1 THEN writeline
END; (* show_path *)

PROCEDURE show_tot_num_paths(VAR f : text);
BEGIN
writeln(f,'     ' (* normal tab *),
    'total number of paths: ',pathnum-1:0)
END; (* show_tot_num_paths *)

PROCEDURE unreach(n : integer; PROCEDURE cp); forward;
PROCEDURE parse(t : integer; PROCEDURE cp);

VAR saveset : markset; i : integer;

    PROCEDURE setinteger(VAR v : integer; val : integer);
    VAR old : integer;
    BEGIN old := v; v := val; cp; v := old END;

    PROCEDURE setmode(newmode : symbol;
                      newgoal : boolean; p : integer);
    VAR savemode : symbol; savegoal : boolean;

        PROCEDURE restoremode;
        BEGIN
        mode := savemode; goal := savegoal;
        cp;
        mode := newmode; goal := newgoal
        END;

    BEGIN (* setmode *)
    savemode := mode; savegoal := goal;
    mode := newmode; goal := newgoal;
    parse(p,restoremode);
    mode := savemode; goal := savegoal
    END; (* setmode *)

    PROCEDURE parsenot(t : integer; PROCEDURE cp);
    VAR oldgoal : boolean; i : integer;

        PROCEDURE restoregoal;
        VAR g : boolean;
        BEGIN g := goal; goal := NOT goal; cp; goal := g END;

    BEGIN (* parsenot *)
    IF mode = execute_op THEN
        BEGIN
        i := pathnum;
        parse(t,skip);
        IF pathnum = i (* no successes *) THEN
            BEGIN pathnum := pathnum + 1; cp END
        END
      ELSE
        BEGIN
        oldgoal := goal; goal := NOT goal;
        parse(t,restoregoal);
        goal := oldgoal
        END;
    END; (* parsenot *)

    PROCEDURE restorefence;
    VAR f : boolean;
    BEGIN f := fenced; fenced := i = 1; cp; fenced := f END;

    PROCEDURE parseright;
    BEGIN parse(code[t].right,cp) END;

    PROCEDURE parsenotright;
    BEGIN parsenot(code[t].right,cp) END;

    PROCEDURE sameagain;
    BEGIN parse(t,cp) END;

    PROCEDURE times(count,argument : integer);
    VAR i : integer;

        PROCEDURE tiimes;
        BEGIN
        i := i - 1;
        IF i < 1 THEN cp ELSE parse(t,tiimes);
        i := i + 1
        END; (* tiimes *)

    BEGIN
    i := count; t := argument;
    parse(t,tiimes)
    END; (* times *)

    PROCEDURE save(this_save : integer);
    VAR i,displacement : integer;
    BEGIN
    displacement := lastplace * this_save;
    FOR i := 1 TO lastplace DO
        saves[i + displacement] := place[i].pl_cur
    END;

    PROCEDURE restore(this_restore : integer);
    VAR i,displacement : integer;
    BEGIN
    displacement := lastplace * this_restore;
    FOR i := 1 TO lastplace DO
        place[i].pl_cur := saves[i + displacement]
    END;

    FUNCTION samestate(this_samestate : integer) : boolean;
    VAR i,displacement : integer;
    BEGIN
    displacement := lastplace * this_samestate;
    i := lastplace;
    REPEAT
        IF place[i].pl_cur = saves[i + displacement]
            THEN i := i - 1 ELSE i := -1
        UNTIL i < 1;
    samestate := i = 0
    END;

    FUNCTION substate(this_substate : integer) : boolean;
    VAR i,displacement : integer;
    BEGIN (* substate *)
    displacement := lastplace * this_substate;
    i := lastplace;
    REPEAT
        IF place[i].pl_cur <= saves[i + displacement]
            THEN i := i - 1 ELSE i := -1
        UNTIL i < 1;
    substate := i = 0
    END; (* substate *)

    FUNCTION superstate(this_superstate : integer) : boolean;
    VAR i,displacement : integer;
    BEGIN (* superstate *)
    displacement := lastplace * this_superstate;
    i := lastplace;
    REPEAT
        IF place[i].pl_cur >= saves[i + displacement]
            THEN i := i - 1 ELSE i := -1
        UNTIL i < 1;
    superstate := i = 0
    END; (* superstate *)

BEGIN (* parse *)
IF writelisting > 3 THEN
    BEGIN
    write(listing,pathnum:0,' ',mode:1,' ',goal:1,' ');
    writenode(t)
    END;
IF pathlength <= maxlength THEN
  WITH code[t] DO
    CASE op OF

(* control *)

        abort_op :
            maxlength := -1; (* instead of GOTO 1 *)
        quit_op :
            GOTO 99;
        nonterm_op :
            parse(right,cp);

(* mode *)

        execute_op,verify_op,possibly_op :
            setmode(op,true,right);

(* regular *)

        skip_op :
            cp;
        fail_op :
            ; (* do nothing *)
        cat_op :
            parse(left,parseright);
        alt_op :
            BEGIN
            parse(left,cp);
            IF NOT fenced THEN parse(right,cp);
            END;
        opt_op :
            BEGIN cp; parse(right,cp) END;
        pos_op :
            BEGIN parse(right,cp); parse(right,sameagain) END;
        rep_op :
            BEGIN cp; parse(right,sameagain) END;
        timmes_op :
            times(left,right);
        showtotpathnum_op :
            BEGIN showtotpathnum := true; cp END;
        fence_op :
            BEGIN fenced := true; cp END;
        newscope_op :
            BEGIN
            i := ord(fenced); fenced := false;
            parse(right,restorefence)
            END;
        maxpaths_op :
            setinteger(maxpaths,left);
        pathnum_op :
            IF pathnum = left THEN cp;

(* boolean *)

        false_op,true_op :
            IF (op = true_op) = goal THEN cp;
        logical_op :
            WITH place[right] DO
                IF ord(goal) IN pl_cur THEN
                    BEGIN
                    saveset := pl_cur;
                    pl_cur := [ord(goal)]; cp;
                    pl_cur := saveset
                    END;
        and_op,or_op :
            IF (op = and_op) = goal
                THEN parse(left,parseright)
                ELSE BEGIN parse(left,cp); parse(right,cp) END;
        not_op :
                parsenot(right,cp);
        imp_op :
            IF goal THEN
                BEGIN
                parsenot(left,cp);
                parse(right,cp)
                END
              ELSE
                parsenot(left,parseright);
        iff_op :
            IF goal THEN
                BEGIN
                parse(left,parseright);
                parsenot(left,parsenotright)
                END
              ELSE
                BEGIN
                parse(left,parsenotright);
                parsenot(left,parseright)
                END;
(* events *)

        trans_op :
            BEGIN
            IF pathlength = maxpathlength THEN
                BEGIN writeln('path is too long'); GOTO 99 END;
            pathlength := pathlength + 1;
            path[pathlength] := left; (* to symtab *)
            parse(right,cp);
            pathlength := pathlength - 1
            END;
        net_op :
            parse(headnode,cp);
        len_op :
            times(left,headnode);
        tab_op :
            times(left-pathlength,headnode);
        position_op :
            IF pathlength = left THEN cp;
        maxlength_op :
            setinteger(maxlength,left);
        show_path_op :
            BEGIN show_path; cp END;

(* state *)

        save_op :
            BEGIN save(left); cp END;
        restore_op :
            BEGIN restore(left); cp END;
        samestate_op :
            IF samestate(left) THEN cp;
        newstate_op :
            BEGIN
            FOR i := 1 TO lastplace DO
                WITH place[i] DO pl_cur := pl_poss;
            cp
            END;
        substate_op :
            IF substate(left) THEN cp;
        superstate_op :
            IF superstate(left) THEN cp;

(* place *)

        set_op :
            WITH place[left] DO
                IF pl_cur * arc_opset <> [] THEN
                    BEGIN
                    saveset := pl_cur;
                    pl_cur := arc_opset;
                    cp;
                    pl_cur := saveset
                    END;
(* ! ! ! ! ! ! ! ! ! THIS NEEDS LOOKING AT ! ! ! ! ! ! ! ! ! ! *)
        empty_op :
            WITH place[left] DO
                IF (0 IN pl_cur) = goal THEN
                    BEGIN
                    saveset := pl_cur;
                    CASE mode OF
                        execute_op,verify_op :
                            IF goal
                                THEN pl_cur := [0]
                                ELSE pl_cur := pl_poss - [0];
                        possibly_op :
                        OTHERWISE
                            point('F',
                                'internal - emptyop            ')
                        END; (* CASE *)
                    cp;
                    pl_cur := saveset
                    END;
        show_markings_op :
            BEGIN show_markings; cp END;
        arc_op :
            WITH place[left] DO
                BEGIN
                saveset := pl_cur;
                CASE mode OF
                    execute_op :
                        IF pl_cur * arc_opset <> [] THEN
                            BEGIN
                            pl_cur := [];
                            IF right < 0 THEN
                                BEGIN (* inarc *)
                                FOR i := - right TO capacity DO
                                    IF i IN saveset THEN
                                        pl_cur := pl_cur + [i + right]
                                END
                              ELSE
                                BEGIN (* outarc_ *)
                                FOR i := 0 TO capacity - right DO
                                    IF i IN saveset THEN
                                        pl_cur := pl_cur + [i + right]
                                END;
                            cp
                            END; (* execute *)
                    verify_op :
                        BEGIN
                        IF goal
                            THEN pl_cur := pl_cur * arc_opset
                            ELSE pl_cur := pl_cur - arc_opset;
                        IF pl_cur <> [] THEN cp
                        END;
                    possibly_op :
                        IF goal AND (pl_cur * arc_opset = []) OR
                        NOT goal AND (pl_cur-arc_opset = []) THEN cp;
                    OTHERWISE
                        point('F',
                            'internal: arc_op              ');
                    END; (* CASE *)
                pl_cur := saveset
                END; (* WITH *)
        deadlock_op :
            setmode(verify_op,false,headnode);
        unreachable_op :
            unreach(headnode,cp);
        OTHERWISE
            BEGIN
            writeln('internal error "parse", op = ',op);
            GOTO 99
            END
        END; (* CASE *)
END; (* parse *)

PROCEDURE unreach; (* (n : integer; PROCEDURE cp) was forward *)
VAR saveset : markset;

    PROCEDURE unreachright;
      BEGIN unreach(code[n].right, cp) END;

BEGIN (* unreach *)
WITH code[n] DO
    CASE op OF
        arc_op :
            WITH place[left] DO
                IF pl_cur - (pl_poss - arc_opset) <> [] THEN
                    BEGIN
                    saveset := pl_cur;
                    pl_cur := pl_cur - (pl_poss - arc_opset);
                    cp;
                    pl_cur := saveset
                    END;
        trans_op :
            unreach(right,cp);
        and_op :
            BEGIN unreach(left, cp); unreach(right, cp) END;
        or_op :
            unreach(left,unreachright);
        OTHERWISE
            parse(n,cp)
        END (* CASE *)
END; (* unreach *)

(* - - - - -  M A I N  - - - - - *)

BEGIN (* main, NETVER *)
10:
initialise;
REPEAT
    codeindex := 0; lastsymtab := 0; lastplace := 0;
    headnode := 0; (* will be inspected in block and below *)
    IF interactive_usage THEN write('?-  ');
    getsym;
    IF sym = quit_op THEN GOTO 90;
     block;
    IF writelisting > 10 THEN
        BEGIN
        writeln(listing);
        writeln(listing,'total code for block:');
        FOR i := 1 TO codeindex DO writenode(i);
        END; (* IF trace > 0 *)
    WHILE sym = path_ DO
        BEGIN
        codeindex := last_block_code; getsym;
        new_id_allowed := false; expression;
        IF trace > 0 THEN
            BEGIN writeln; writeln('code to be executed:') END;
        FOR i := last_block_code + 1 TO codeindex DO
            WITH code[i] DO
                BEGIN
                IF op = nonterm_op THEN
                    right := symtab[left].val; (* fixup *)
                IF trace > 0 THEN writenode(i)
                END;
        maxlength := maxint; pathnum := 1; pathlength := 0;
        maxpaths := maxint;
        fenced := false; mode := execute_op; goal := true;
        showtotpathnum := false;
        IF trace > 0 THEN
            BEGIN writeln; writeln('executing ...') END;
        parse(codeindex,skip);
        IF showtotpathnum THEN
            BEGIN
            show_tot_num_paths(output);
            IF writelisting > 0 THEn show_tot_num_paths(listing)
            END;
        IF sym = semicol_ THEN getsym
        END;
    UNTIL false;
90: ;
99: finalise;
END. (* main, NETVER *)
#+end_src

