20-petri-net-verifier.html
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> The program</h2>
<div class="outline-text-2" id="text-9">
<p>
The following is the source:
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">PROGRAM</span> <span style="color: #ffffff; font-weight: bold;">netver</span>(input,output);

LABEL 10,90,99;

<span style="color: #ff00ff;">CONST</span>
    errormark = <span style="color: #00ff00;">'%NV'</span>;
    list_filename = <span style="color: #00ff00;">'45netver.lst'</span>;
    reslength = 16; emptyres = <span style="color: #00ff00;">'                '</span>;
    maxrestab = 70;
    identlength = 16; emptyident = <span style="color: #00ff00;">'                '</span>;
    maxstdidenttab = 1; <span style="color: #66f;">(* </span><span style="color: #66f;">dummy *)</span>

<span style="color: #ff00ff;">TYPE</span>
    symbol =
        (place_id,transition_id,nonterminal_id,logical_id,
         new_id,identifier,
        <span style="color: #66f;">(* </span><span style="color: #66f;">no more idents after here *)</span>
         true_op,false_op,
         net_op,skip_op,fail_op,abort_op,quit_op,
         deadlock_op,unreachable_op,fence_op,set_op,showtotpathnum_op,
         empty_op,atleast_op,atmost_op,newstate_op,
         show_path_op,show_markings_op,arc_op,trans_op,nonterm_op,
         logical_op,
         execute_op,verify_op,possibly_op,
         opt_op,pos_op,rep_op,timmes_op,not_op,newscope_op,
         len_op,maxlength_op,maxpaths_op,position_op,tab_op,
         pathnum_op,
         save_op,restore_op,samestate_op,substate_op,superstate_op,
         leftparenthesis,
        <span style="color: #66f;">(* </span><span style="color: #66f;">no more  facbegsys after here *)</span>
         and_op, <span style="color: #66f;">(* </span><span style="color: #66f;">must be here, see TERM *)</span>
         cat_op,or_op,imp_op,iff_op,alt_op,
         rightparenthesis_,
         comma_,period_,colon_,bnfarrow_,semicol_,queery_,
         end_,inarc_,outarc_,action_,
         path_,place_,production_,transition_,logical_,
        <span style="color: #66f;">(* </span><span style="color: #66f;">compulsory for scanutilities: *)</span>
         charconst,stringconst,numberconst,hyphen);
    standardident = (dummy);

%INCLUDE <span style="color: #00ff00;">'41SCANUT.PAS'</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">initialise</span>;
<span style="color: #ff00ff;">VAR</span> i : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">initialise *)</span>
iniscanner;
specials_repeat := [<span style="color: #00ff00;">':'</span>,<span style="color: #00ff00;">'='</span>];
erw(<span style="color: #00ff00;">')               '</span>,rightparenthesis_);
erw(<span style="color: #00ff00;">',               '</span>,comma_);
erw(<span style="color: #00ff00;">'.               '</span>,period_);
erw(<span style="color: #00ff00;">':               '</span>,colon_);
erw(<span style="color: #00ff00;">'::=             '</span>,bnfarrow_);
erw(<span style="color: #00ff00;">';               '</span>,semicol_);
erw(<span style="color: #00ff00;">'?               '</span>,queery_);
erw(<span style="color: #00ff00;">'ABORT           '</span>,abort_op);
erw(<span style="color: #00ff00;">'ACTION          '</span>,action_);
erw(<span style="color: #00ff00;">'ALT             '</span>,alt_op);
erw(<span style="color: #00ff00;">'AND             '</span>,and_op);
erw(<span style="color: #00ff00;">'ATLEAST         '</span>,atleast_op);
erw(<span style="color: #00ff00;">'ATMOST          '</span>,atmost_op);
erw(<span style="color: #00ff00;">'DEADLOCK        '</span>,deadlock_op);
erw(<span style="color: #00ff00;">'EMPTY           '</span>,empty_op);
erw(<span style="color: #00ff00;">'END             '</span>,end_);
erw(<span style="color: #00ff00;">'EXECUTE         '</span>,execute_op);
erw(<span style="color: #00ff00;">'FAIL            '</span>,fail_op);
erw(<span style="color: #00ff00;">'FALSE           '</span>,false_op);
erw(<span style="color: #00ff00;">'FENCE           '</span>,fence_op);
erw(<span style="color: #00ff00;">'IFF             '</span>,iff_op);
erw(<span style="color: #00ff00;">'IMP             '</span>,imp_op);
erw(<span style="color: #00ff00;">'INARC           '</span>,inarc_);
erw(<span style="color: #00ff00;">'LEN             '</span>,len_op);
erw(<span style="color: #00ff00;">'LOGICAL         '</span>,logical_);
erw(<span style="color: #00ff00;">'MAXLENGTH       '</span>,maxlength_op);
erw(<span style="color: #00ff00;">'MAXPATHS        '</span>,maxpaths_op);
erw(<span style="color: #00ff00;">'NET             '</span>,net_op);
erw(<span style="color: #00ff00;">'NEWSCOPE        '</span>,newscope_op);
erw(<span style="color: #00ff00;">'NEWSTATE        '</span>,newstate_op);
erw(<span style="color: #00ff00;">'NOT             '</span>,not_op);
erw(<span style="color: #00ff00;">'OPT             '</span>,opt_op);
erw(<span style="color: #00ff00;">'OR              '</span>,or_op);
erw(<span style="color: #00ff00;">'OUTARC          '</span>,outarc_);
erw(<span style="color: #00ff00;">'PATH            '</span>,path_);
erw(<span style="color: #00ff00;">'PATHNUM         '</span>,pathnum_op);
erw(<span style="color: #00ff00;">'PLACE           '</span>,place_);
erw(<span style="color: #00ff00;">'POS             '</span>,pos_op);
erw(<span style="color: #00ff00;">'POSITION        '</span>,position_op);
erw(<span style="color: #00ff00;">'POSSIBLY        '</span>,possibly_op);
erw(<span style="color: #00ff00;">'PRODUCTION      '</span>,production_);
erw(<span style="color: #00ff00;">'QUIT            '</span>,quit_op);
erw(<span style="color: #00ff00;">'REP             '</span>,rep_op);
erw(<span style="color: #00ff00;">'RESTORE         '</span>,restore_op);
erw(<span style="color: #00ff00;">'SAMESTATE       '</span>,samestate_op);
erw(<span style="color: #00ff00;">'SAVE            '</span>,save_op);
erw(<span style="color: #00ff00;">'SET             '</span>,set_op);
erw(<span style="color: #00ff00;">'SHOW_MARKINGS   '</span>,show_markings_op);
erw(<span style="color: #00ff00;">'SHOW_PATH       '</span>,show_path_op);
erw(<span style="color: #00ff00;">'SHOW_TOTAL      '</span>,showtotpathnum_op);
erw(<span style="color: #00ff00;">'SKIP            '</span>,skip_op);
erw(<span style="color: #00ff00;">'SUBSTATE        '</span>,substate_op);
erw(<span style="color: #00ff00;">'SUPERSTATE      '</span>,superstate_op);
erw(<span style="color: #00ff00;">'TAB             '</span>,tab_op);
erw(<span style="color: #00ff00;">'TIMES           '</span>,timmes_op);
erw(<span style="color: #00ff00;">'TRANSITION      '</span>,transition_);
erw(<span style="color: #00ff00;">'TRUE            '</span>,true_op);
erw(<span style="color: #00ff00;">'UNREACHABLE     '</span>,unreachable_op);
erw(<span style="color: #00ff00;">'VERIFY          '</span>,verify_op);
erw(<span style="color: #00ff00;">'|               '</span>,alt_op);
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">initialise *)</span>

<span style="color: #ff00ff;">CONST</span>
    interactive_usage = false;
    maxplaces = 50;
    maxsaves = 200;
    maxsymtab = 100;
    maxcode = 1000;
    maxpathlength = 100;
    maxcapacity = 31;
<span style="color: #ff00ff;">TYPE</span>
    operator = net_op .. or_op;
    markset = <span style="color: #ff00ff;">SET</span> <span style="color: #00ffff;">OF</span> 0 .. maxcapacity;
<span style="color: #ff00ff;">VAR</span>
    symtab : <span style="color: #ff00ff;">ARRAY</span> [0 .. maxsymtab] <span style="color: #00ffff;">OF</span> <span style="color: #66f;">(* </span><span style="color: #66f;">0 for sentinel *)</span>
        <span style="color: #ff00ff;">RECORD</span>
            alf : identalfa;
            obj : symbol;
            val : <span style="color: #ff00ff;">integer</span>
            <span style="color: #00ffff;">END</span>;
    lastsymtab,location : <span style="color: #ff00ff;">integer</span>;
    new_id_allowed : <span style="color: #ff00ff;">boolean</span>;
    code : <span style="color: #ff00ff;">ARRAY</span> [1 .. maxcode] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">RECORD</span>
                op : operator; left, right : <span style="color: #ff00ff;">integer</span>;
                arc_opset : markset;
                <span style="color: #00ffff;">END</span>;
    codeindex, headnode, last_block_code : <span style="color: #ff00ff;">integer</span>;
    place : <span style="color: #ff00ff;">ARRAY</span> [1 .. maxplaces] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">RECORD</span>
                symtab_ptr, capacity : <span style="color: #ff00ff;">integer</span>;
                pl_poss, pl_cur : markset
                <span style="color: #00ffff;">END</span>;
    lastplace : <span style="color: #ff00ff;">integer</span>;
    saves : <span style="color: #ff00ff;">ARRAY</span> [1..maxsaves] <span style="color: #00ffff;">OF</span> markset;
    path : <span style="color: #ff00ff;">ARRAY</span> [1..maxpathlength] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">integer</span>;
    pathlength,maxlength : <span style="color: #ff00ff;">integer</span>;
    pathnum,maxpaths : <span style="color: #ff00ff;">integer</span>;
    fenced,showtotpathnum : <span style="color: #ff00ff;">boolean</span>;
    mode : symbol; goal : <span style="color: #ff00ff;">boolean</span>;
    i,j : <span style="color: #ff00ff;">integer</span>;

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -   U T I L I T I E S   - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">lookup</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">lookup *)</span>
symtab[0].alf := ident; location := lastsymtab;
<span style="color: #00ffff;">WHILE</span> symtab[location].alf &lt;&gt; ident <span style="color: #00ffff;">DO</span> location := location - 1;
<span style="color: #00ffff;">IF</span> location = 0 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
    lastsymtab := lastsymtab + 1;
    <span style="color: #00ffff;">WITH</span> symtab[lastsymtab] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span> alf := ident; obj := new_id; val := 0 <span style="color: #00ffff;">END</span>;
    location := lastsymtab;
    <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">WITH</span> symtab[location] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span> sym := obj; num := val <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">lookup *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">generate</span>(o : operator; x,y : <span style="color: #ff00ff;">integer</span>);
<span style="color: #00ffff;">BEGIN</span>
codeindex := codeindex + 1;
<span style="color: #00ffff;">WITH</span> code[codeindex] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span> op := o; left := x; right := y <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">generate *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writenode</span>(n : <span style="color: #ff00ff;">integer</span>);
<span style="color: #00ffff;">BEGIN</span>
<span style="color: #00ffff;">WITH</span> code[n] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">IF</span> n = headnode
        <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">write</span>(listing,<span style="color: #00ff00;">'***'</span>)
        <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">write</span>(listing,<span style="color: #00ff00;">'   '</span>);
    <span style="color: #00ffff;">write</span>(listing,n:4,<span style="color: #00ff00;">'  '</span>, op:16,<span style="color: #00ff00;">'  '</span>,left:6,right:6);
    <span style="color: #00ffff;">CASE</span> op <span style="color: #00ffff;">OF</span>
        arc_op :
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">write</span>(listing,<span style="color: #00ff00;">'   '</span>);
            <span style="color: #00ffff;">FOR</span> j := 0 <span style="color: #00ffff;">TO</span> place[left].capacity <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">IF</span> j <span style="color: #00ffff;">IN</span> arc_opset <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">write</span>(listing,j:0,<span style="color: #00ff00;">' '</span>)
            <span style="color: #00ffff;">END</span>;
        logical_op,trans_op,nonterm_op :
            <span style="color: #00ffff;">write</span>(listing,<span style="color: #00ff00;">'  '</span>,symtab[left].alf);
        <span style="color: #00ffff;">END</span>;
    writeln(listing)
    <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">writenode *)</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -   I N P U T  - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">expression</span>;
<span style="color: #ff00ff;">VAR</span> left : <span style="color: #ff00ff;">integer</span>; oper : operator;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">term</span>;
    <span style="color: #ff00ff;">VAR</span> left : <span style="color: #ff00ff;">integer</span>; oper : operator;

        <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">factor</span>;
        <span style="color: #ff00ff;">VAR</span> oper : operator; n : <span style="color: #ff00ff;">integer</span>;
        <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">factor *)</span>
        <span style="color: #00ffff;">IF</span> sym = identifier <span style="color: #00ffff;">THEN</span> lookup;
        <span style="color: #00ffff;">CASE</span> sym <span style="color: #00ffff;">OF</span>
            new_id,nonterminal_id :
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">IF</span> sym = new_id <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> new_id_allowed <span style="color: #00ffff;">THEN</span>
                        point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'new identifier not allowed    '</span>);
                    symtab[location].obj := nonterminal_id;
                    <span style="color: #00ffff;">END</span>;
                generate(nonterm_op,location,0 <span style="color: #66f;">(* </span><span style="color: #66f;">fixed in BLOCK *)</span> );
                getsym
                <span style="color: #00ffff;">END</span>;
            transition_id :
                <span style="color: #00ffff;">BEGIN</span>
                generate(trans_op,location,num); getsym
                <span style="color: #00ffff;">END</span>;
            logical_id :
                <span style="color: #00ffff;">BEGIN</span>
                generate(logical_op,location,num); getsym
                <span style="color: #00ffff;">END</span>;
            net_op,skip_op,fail_op,abort_op,quit_op,
            true_op,false_op,
            deadlock_op,unreachable_op,fence_op,showtotpathnum_op,
            newstate_op,
            show_path_op,show_markings_op :
                <span style="color: #00ffff;">BEGIN</span>
                generate(sym,0,0); getsym
                <span style="color: #00ffff;">END</span>;
            execute_op,verify_op,possibly_op,newscope_op,
            not_op,opt_op,pos_op,rep_op :
                <span style="color: #00ffff;">BEGIN</span>
                oper := sym; getsym; factor;
                generate(oper,0,codeindex)
                <span style="color: #00ffff;">END</span>;
            timmes_op :
                <span style="color: #00ffff;">BEGIN</span>
                getsym;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; numberconst <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'number expected               '</span>);
                n := num; getsym; factor;
                generate(timmes_op,n,codeindex)
                <span style="color: #00ffff;">END</span>;
            save_op,restore_op,samestate_op,substate_op,superstate_op,
            len_op,maxlength_op,maxpaths_op,position_op,tab_op,
            pathnum_op :
                <span style="color: #00ffff;">BEGIN</span>
                oper := sym; getsym;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; numberconst <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'number expected               '</span>);
                generate(oper,num,0); getsym
                <span style="color: #00ffff;">END</span>;
            empty_op :
                <span style="color: #00ffff;">BEGIN</span>
                getsym;
                lookup;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; place_id <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'place identifier expected     '</span>);
                generate(empty_op,num,0); getsym
                <span style="color: #00ffff;">END</span>;
            atleast_op,atmost_op :
                <span style="color: #00ffff;">BEGIN</span>
                oper := sym; getsym;
                lookup;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; place_id <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'place identifier expected     '</span>);
                n := num; getsym;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; numberconst <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'number expected               '</span>);
                generate(oper,n,num); getsym
                <span style="color: #00ffff;">END</span>;
            set_op :
                <span style="color: #00ffff;">BEGIN</span>
                getsym;
                lookup;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; place_id <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'place identifier expected     '</span>);
                generate(set_op,num,0);
                code[codeindex].arc_opset := [];
                getsym;
                <span style="color: #00ffff;">WHILE</span> sym = numberconst <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    <span style="color: #00ffff;">WITH</span> code[codeindex] <span style="color: #00ffff;">DO</span>
                        arc_opset := arc_opset + [num];
                    getsym
                    <span style="color: #00ffff;">END</span>
                <span style="color: #00ffff;">END</span>;
            leftparenthesis :
                <span style="color: #00ffff;">BEGIN</span>
                getsym;
                expression;
                check(rightparenthesis_,[],
                    <span style="color: #00ff00;">'")" expected                  '</span>);
                <span style="color: #00ffff;">END</span>;
            OTHERWISE
                point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'internal error in factor      '</span>);
            <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">factor *)</span>

    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">term *)</span>
    factor;
    <span style="color: #00ffff;">IF</span> sym &lt;= and_op <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        left := codeindex;
        <span style="color: #00ffff;">IF</span> sym &lt;= leftparenthesis <span style="color: #00ffff;">THEN</span> oper := cat_op <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span> oper := sym; getsym <span style="color: #00ffff;">END</span>;
        term; generate(oper,left,codeindex)
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">term *)</span>;

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">expression *)</span>
term;
<span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> [alt_op,or_op,imp_op,iff_op] <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
    left := codeindex; oper := sym; getsym;
    expression; generate(oper,left,codeindex)
    <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">expression *)</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">block</span>;

<span style="color: #ff00ff;">VAR</span>
    loc, cap, toknum, i : <span style="color: #ff00ff;">integer</span>;
    poss : markset;
    net_fix : <span style="color: #ff00ff;">integer</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">arc_list</span>;
    <span style="color: #ff00ff;">VAR</span> left : <span style="color: #ff00ff;">integer</span>;

        <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">onearc</span>;
        <span style="color: #ff00ff;">VAR</span> tr_declarator : symbol; i : <span style="color: #ff00ff;">integer</span>;

            <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">placelist</span>;
            <span style="color: #ff00ff;">VAR</span> left : <span style="color: #ff00ff;">integer</span>;

                <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">oneplace</span>;
                <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">oneplace *)</span>
                lookup;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; place_id <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'place identifier expected     '</span>)
                  <span style="color: #00ffff;">ELSE</span>
                    <span style="color: #00ffff;">BEGIN</span> generate(arc_op,num,99999); getsym <span style="color: #00ffff;">END</span>
                <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">oneplace *)</span>

            <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">placelist *)</span>
            oneplace;
            <span style="color: #00ffff;">IF</span> sym = comma_ <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span>
                left := codeindex; getsym;
                placelist; generate(and_op,left,codeindex)
                <span style="color: #00ffff;">END</span>
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">placelist *)</span>

        <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">onearc *)</span>
        tr_declarator := sym; getsym;
        <span style="color: #00ffff;">IF</span> tr_declarator = action_ <span style="color: #00ffff;">THEN</span> expression <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">arc *)</span>
            i := codeindex; placelist;
            <span style="color: #00ffff;">IF</span> sym &lt;&gt; numberconst <span style="color: #00ffff;">then</span> toknum := 1 <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">BEGIN</span> toknum := num; getsym <span style="color: #00ffff;">END</span>;
            <span style="color: #00ffff;">WHILE</span> i &lt; codeindex <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">update *)</span>
                i := i + 1;
                <span style="color: #00ffff;">WITH</span> code[i] <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">IF</span> op = arc_op <span style="color: #00ffff;">THEN</span>
                        <span style="color: #00ffff;">BEGIN</span>
                        cap := place[left].capacity;
                        <span style="color: #00ffff;">IF</span> tr_declarator = inarc_ <span style="color: #00ffff;">THEN</span>
                            <span style="color: #00ffff;">BEGIN</span>
                            arc_opset := [toknum .. cap];
                            right := - toknum
                            <span style="color: #00ffff;">END</span>
                          <span style="color: #00ffff;">ELSE</span>
                            <span style="color: #00ffff;">BEGIN</span>
                            arc_opset := [0 .. cap - toknum];
                            right := toknum
                            <span style="color: #00ffff;">END</span>
                        <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">arc_op *)</span>
                <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">update *)</span>
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">arc *)</span>
        <span style="color: #00ffff;">IF</span> sym = semicol_ <span style="color: #00ffff;">THEN</span> getsym;
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">onearc *)</span>

    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">arc_list *)</span>
    onearc;
    <span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> [inarc_,outarc_,action_] <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        left := codeindex;
        arc_list; generate(and_op,left,codeindex)
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">arc_list *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">block *)</span>
new_id_allowed := true;
<span style="color: #00ffff;">WHILE</span> sym <span style="color: #00ffff;">IN</span> [place_,transition_,production_,logical_] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">CASE</span> sym <span style="color: #00ffff;">OF</span>
        logical_ :
            <span style="color: #00ffff;">BEGIN</span>
            getsym;
            <span style="color: #00ffff;">WHILE</span> sym = identifier <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">REPEAT</span>
                    lookup;
                    <span style="color: #00ffff;">IF</span> sym &lt;&gt; new_id <span style="color: #00ffff;">THEN</span>
                        point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'new identifier expected       '</span>);
                    lastplace := lastplace + 1;
                    <span style="color: #00ffff;">WITH</span> place[lastplace] <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">BEGIN</span>
                        symtab_ptr := location; capacity := 1;
                        pl_poss := [0,1]; pl_cur := [0,1]
                        <span style="color: #00ffff;">END</span>;
                    <span style="color: #00ffff;">WITH</span> symtab[location] <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">BEGIN</span> obj := logical_id; val := lastplace <span style="color: #00ffff;">END</span>;
                    getsym;
                    <span style="color: #00ffff;">IF</span> sym = comma_ <span style="color: #00ffff;">THEN</span> getsym
                    <span style="color: #00ffff;">UNTIL</span> <span style="color: #00ffff;">NOT</span> (sym &lt;= identifier);
                <span style="color: #00ffff;">IF</span> sym = semicol_ <span style="color: #00ffff;">THEN</span> getsym
                <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE ident *)</span>
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">logical *)</span>
        place_ :
            <span style="color: #00ffff;">BEGIN</span>
            getsym;
            <span style="color: #00ffff;">WHILE</span> sym &lt;= identifier <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                i := lastplace;
                <span style="color: #00ffff;">REPEAT</span>
                    lookup;
                    <span style="color: #00ffff;">IF</span> sym &lt;&gt; new_id <span style="color: #00ffff;">THEN</span>
                        point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'new identifier expected       '</span>);
                    lastplace := lastplace + 1;
                    place[lastplace].symtab_ptr := location;
                    <span style="color: #00ffff;">WITH</span> symtab[location] <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">BEGIN</span> obj := place_id; val := lastplace <span style="color: #00ffff;">END</span>;
                    getsym;
                    <span style="color: #00ffff;">IF</span> sym = comma_ <span style="color: #00ffff;">THEN</span> getsym
                    <span style="color: #00ffff;">UNTIL</span> <span style="color: #00ffff;">NOT</span> (sym &lt;= identifier);
                <span style="color: #00ffff;">IF</span> sym = colon_ <span style="color: #00ffff;">THEN</span> getsym;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; numberconst <span style="color: #00ffff;">THEN</span> cap := 1 <span style="color: #00ffff;">ELSE</span>
                    <span style="color: #00ffff;">BEGIN</span> cap := num; getsym <span style="color: #00ffff;">END</span>;
                poss := [0 .. cap];
                <span style="color: #00ffff;">WHILE</span> i &lt; lastplace <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">update *)</span>
                    i := i + 1;
                    <span style="color: #00ffff;">WITH</span> place[i] <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">BEGIN</span>
                        capacity := cap;
                        pl_poss := poss;
                        pl_cur := poss
                        <span style="color: #00ffff;">END</span>
                    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE *)</span>
                <span style="color: #00ffff;">IF</span> sym = semicol_ <span style="color: #00ffff;">THEN</span> getsym
                <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE ident *)</span>
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">place *)</span>
        transition_ :
            <span style="color: #00ffff;">BEGIN</span>
            getsym;
            <span style="color: #00ffff;">WHILE</span> sym = identifier <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                loc := lastsymtab + 1;
                <span style="color: #00ffff;">REPEAT</span>
                    lookup;
                    <span style="color: #00ffff;">IF</span> sym &lt;&gt; new_id <span style="color: #00ffff;">THEN</span>
                        point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'new identifier expected       '</span>);
                    symtab[location].obj := transition_id;
                    getsym;
                    <span style="color: #00ffff;">IF</span> sym = comma_ <span style="color: #00ffff;">THEN</span> getsym
                    <span style="color: #00ffff;">UNTIL</span> <span style="color: #00ffff;">NOT</span> (sym &lt;= identifier);
                <span style="color: #00ffff;">IF</span> sym = semicol_ <span style="color: #00ffff;">THEN</span> getsym;
                <span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> [inarc_,outarc_,action_]
                    <span style="color: #00ffff;">THEN</span> arc_list
                    <span style="color: #00ffff;">ELSE</span> generate(skip_op,0,0);
                <span style="color: #00ffff;">WHILE</span> loc &lt;= lastsymtab <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    symtab[loc].val :=codeindex; loc := loc + 1
                    <span style="color: #00ffff;">END</span>
                <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE ident *)</span>
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">transition *)</span>
        production_ :
            <span style="color: #00ffff;">BEGIN</span>
            getsym;
            <span style="color: #00ffff;">WHILE</span> sym = identifier <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                lookup;
                <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> (sym <span style="color: #00ffff;">IN</span> [new_id, nonterminal_id]) <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'nonterminal expected          '</span>);
                <span style="color: #00ffff;">IF</span> sym = new_id <span style="color: #00ffff;">THEN</span>
                    symtab[location].obj := nonterminal_id;
                loc := location; getsym;
                check(bnfarrow_,[],<span style="color: #00ff00;">'"::=" expected                '</span>);
                expression; symtab[loc].val := codeindex;
                <span style="color: #00ffff;">IF</span> sym = semicol_ <span style="color: #00ffff;">THEN</span> getsym
                <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE idents *)</span>
            <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">production *)</span>
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
<span style="color: #00ffff;">IF</span> writelisting &gt; 1 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span> writeln(listing); writeln(listing,<span style="color: #00ff00;">'symbol table: '</span>) <span style="color: #00ffff;">END</span>;
net_fix := 0;
<span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lastsymtab <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">WITH</span> symtab[i] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">CASE</span> obj <span style="color: #00ffff;">OF</span>
            transition_id :
                <span style="color: #00ffff;">BEGIN</span>
                generate(trans_op,i,val);
                generate(or_op,codeindex,0);
                <span style="color: #00ffff;">IF</span> headnode = 0
                    <span style="color: #00ffff;">THEN</span> headnode := codeindex
                    <span style="color: #00ffff;">ELSE</span> code[net_fix].right := codeindex;
                net_fix := codeindex;
                <span style="color: #00ffff;">END</span>;
            nonterminal_id :
                <span style="color: #00ffff;">IF</span> val = 0 <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'undefined non-terminal        '</span>);
                    putch(<span style="color: #00ff00;">'"'</span>); writeident(alf); putch(<span style="color: #00ff00;">'"'</span>);
                    writeline; <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">99</span>
                    <span style="color: #00ffff;">END</span>;
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
        <span style="color: #00ffff;">IF</span> writelisting &gt; 1 <span style="color: #00ffff;">THEN</span>
            writeln(i:3,<span style="color: #00ff00;">' '</span>,alf:identlength,<span style="color: #00ff00;">' '</span>,obj,<span style="color: #00ff00;">' '</span>,val)
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WITH,FOR *)</span>
<span style="color: #00ffff;">IF</span> headnode &lt;&gt; 0 <span style="color: #00ffff;">THEN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">delete the last "OR" for transitions *)</span>
    <span style="color: #00ffff;">BEGIN</span>
    codeindex := codeindex - 1;
    code[codeindex - 1].right := code[codeindex + 1].left;
    <span style="color: #00ffff;">END</span>;
last_block_code := codeindex;
<span style="color: #00ffff;">IF</span> writelisting &gt; 2 <span style="color: #00ffff;">THEN</span>
    writeln(listing,<span style="color: #00ff00;">'code for this block'</span>);
<span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> codeindex <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">WITH</span> code[i] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">IF</span> op = nonterm_op <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            right := symtab[left].val; <span style="color: #66f;">(* </span><span style="color: #66f;">fixup *)</span>
            <span style="color: #00ffff;">IF</span> writelisting &gt; 2 <span style="color: #00ffff;">THEN</span> writenode(i)
            <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">block *)</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -  A N A L Y S I S  - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">skip</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">skip *)</span>
<span style="color: #00ffff;">IF</span> pathnum = maxpaths <span style="color: #00ffff;">THEN</span>
    maxlength := -1; <span style="color: #66f;">(* </span><span style="color: #66f;">this will block further tries *)</span>
pathnum := pathnum + 1
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">skip *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">show_markings</span>;
<span style="color: #ff00ff;">VAR</span> i,j : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">show_markings *)</span>
writeident(<span style="color: #00ff00;">'mark            '</span>); putch(<span style="color: #00ff00;">' '</span>);
writeinteger(pathnum); putch(<span style="color: #00ff00;">':'</span>); writeline;
<span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lastplace <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">WITH</span> place[i] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">IF</span> pl_cur &lt;&gt; pl_poss <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            putch(chr(9));
            writeident(symtab[symtab_ptr].alf); putch(<span style="color: #00ff00;">' '</span>);
            <span style="color: #00ffff;">FOR</span> j := 0 <span style="color: #00ffff;">TO</span> capacity <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">IF</span> j <span style="color: #00ffff;">IN</span> pl_cur <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    <span style="color: #00ffff;">IF</span> symtab[symtab_ptr].obj &lt;&gt; logical_id
                        <span style="color: #00ffff;">THEN</span> writeinteger(j)
                    <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> j = 0 <span style="color: #00ffff;">THEN</span> writeident(<span style="color: #00ff00;">'FALSE           '</span>)
                    <span style="color: #00ffff;">ELSE</span> writeident(<span style="color: #00ff00;">'TRUE            '</span>);
                    putch(<span style="color: #00ff00;">' '</span>)
                    <span style="color: #00ffff;">END</span>;
            writeline
            <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">show_markings *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">show_path</span>;
<span style="color: #ff00ff;">VAR</span> i : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">show_path *)</span>
writeident(<span style="color: #00ff00;">'path            '</span>); putch(<span style="color: #00ff00;">' '</span>);
writeinteger(pathnum); putch(<span style="color: #00ff00;">':'</span>); writeline;
<span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> pathlength <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span> writeident(symtab[path[i]].alf); putch(<span style="color: #00ff00;">' '</span>) <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">IF</span> pathlength &gt; 1 <span style="color: #00ffff;">THEN</span> writeline
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">show_path *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">show_tot_num_paths</span>(<span style="color: #ff00ff;">VAR</span> f : text);
<span style="color: #00ffff;">BEGIN</span>
writeln(f,<span style="color: #00ff00;">'     '</span> <span style="color: #66f;">(* </span><span style="color: #66f;">normal tab *)</span>,
    <span style="color: #00ff00;">'total number of paths: '</span>,pathnum-1:0)
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">show_tot_num_paths *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">unreach</span>(n : <span style="color: #ff00ff;">integer</span>; PROCEDURE cp); <span style="color: #00ffff;">forward</span>;
<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">parse</span>(t : <span style="color: #ff00ff;">integer</span>; PROCEDURE cp);

<span style="color: #ff00ff;">VAR</span> saveset : markset; i : <span style="color: #ff00ff;">integer</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">setinteger</span>(<span style="color: #ff00ff;">VAR</span> v : <span style="color: #ff00ff;">integer</span>; val : <span style="color: #ff00ff;">integer</span>);
    <span style="color: #ff00ff;">VAR</span> old : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span> old := v; v := val; cp; v := old <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">setmode</span>(newmode : symbol;
                      newgoal : <span style="color: #ff00ff;">boolean</span>; p : <span style="color: #ff00ff;">integer</span>);
    <span style="color: #ff00ff;">VAR</span> savemode : symbol; savegoal : <span style="color: #ff00ff;">boolean</span>;

        <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">restoremode</span>;
        <span style="color: #00ffff;">BEGIN</span>
        mode := savemode; goal := savegoal;
        cp;
        mode := newmode; goal := newgoal
        <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">setmode *)</span>
    savemode := mode; savegoal := goal;
    mode := newmode; goal := newgoal;
    parse(p,restoremode);
    mode := savemode; goal := savegoal
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">setmode *)</span>

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">parsenot</span>(t : <span style="color: #ff00ff;">integer</span>; PROCEDURE cp);
    <span style="color: #ff00ff;">VAR</span> oldgoal : <span style="color: #ff00ff;">boolean</span>; i : <span style="color: #ff00ff;">integer</span>;

        <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">restoregoal</span>;
        <span style="color: #ff00ff;">VAR</span> g : <span style="color: #ff00ff;">boolean</span>;
        <span style="color: #00ffff;">BEGIN</span> g := goal; goal := <span style="color: #00ffff;">NOT</span> goal; cp; goal := g <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">parsenot *)</span>
    <span style="color: #00ffff;">IF</span> mode = execute_op <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        i := pathnum;
        parse(t,skip);
        <span style="color: #00ffff;">IF</span> pathnum = i <span style="color: #66f;">(* </span><span style="color: #66f;">no successes *)</span> <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span> pathnum := pathnum + 1; cp <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">END</span>
      <span style="color: #00ffff;">ELSE</span>
        <span style="color: #00ffff;">BEGIN</span>
        oldgoal := goal; goal := <span style="color: #00ffff;">NOT</span> goal;
        parse(t,restoregoal);
        goal := oldgoal
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">parsenot *)</span>

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">restorefence</span>;
    <span style="color: #ff00ff;">VAR</span> f : <span style="color: #ff00ff;">boolean</span>;
    <span style="color: #00ffff;">BEGIN</span> f := fenced; fenced := i = 1; cp; fenced := f <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">parseright</span>;
    <span style="color: #00ffff;">BEGIN</span> parse(code[t].right,cp) <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">parsenotright</span>;
    <span style="color: #00ffff;">BEGIN</span> parsenot(code[t].right,cp) <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">sameagain</span>;
    <span style="color: #00ffff;">BEGIN</span> parse(t,cp) <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">times</span>(count,argument : <span style="color: #ff00ff;">integer</span>);
    <span style="color: #ff00ff;">VAR</span> i : <span style="color: #ff00ff;">integer</span>;

        <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">tiimes</span>;
        <span style="color: #00ffff;">BEGIN</span>
        i := i - 1;
        <span style="color: #00ffff;">IF</span> i &lt; 1 <span style="color: #00ffff;">THEN</span> cp <span style="color: #00ffff;">ELSE</span> parse(t,tiimes);
        i := i + 1
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">tiimes *)</span>

    <span style="color: #00ffff;">BEGIN</span>
    i := count; t := argument;
    parse(t,tiimes)
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">times *)</span>

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">save</span>(this_save : <span style="color: #ff00ff;">integer</span>);
    <span style="color: #ff00ff;">VAR</span> i,displacement : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span>
    displacement := lastplace * this_save;
    <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lastplace <span style="color: #00ffff;">DO</span>
        saves[i + displacement] := place[i].pl_cur
    <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">restore</span>(this_restore : <span style="color: #ff00ff;">integer</span>);
    <span style="color: #ff00ff;">VAR</span> i,displacement : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span>
    displacement := lastplace * this_restore;
    <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lastplace <span style="color: #00ffff;">DO</span>
        place[i].pl_cur := saves[i + displacement]
    <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">samestate</span>(this_samestate : <span style="color: #ff00ff;">integer</span>) : <span style="color: #ff00ff;">boolean</span>;
    <span style="color: #ff00ff;">VAR</span> i,displacement : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span>
    displacement := lastplace * this_samestate;
    i := lastplace;
    <span style="color: #00ffff;">REPEAT</span>
        <span style="color: #00ffff;">IF</span> place[i].pl_cur = saves[i + displacement]
            <span style="color: #00ffff;">THEN</span> i := i - 1 <span style="color: #00ffff;">ELSE</span> i := -1
        <span style="color: #00ffff;">UNTIL</span> i &lt; 1;
    samestate := i = 0
    <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">substate</span>(this_substate : <span style="color: #ff00ff;">integer</span>) : <span style="color: #ff00ff;">boolean</span>;
    <span style="color: #ff00ff;">VAR</span> i,displacement : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">substate *)</span>
    displacement := lastplace * this_substate;
    i := lastplace;
    <span style="color: #00ffff;">REPEAT</span>
        <span style="color: #00ffff;">IF</span> place[i].pl_cur &lt;= saves[i + displacement]
            <span style="color: #00ffff;">THEN</span> i := i - 1 <span style="color: #00ffff;">ELSE</span> i := -1
        <span style="color: #00ffff;">UNTIL</span> i &lt; 1;
    substate := i = 0
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">substate *)</span>

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">superstate</span>(this_superstate : <span style="color: #ff00ff;">integer</span>) : <span style="color: #ff00ff;">boolean</span>;
    <span style="color: #ff00ff;">VAR</span> i,displacement : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">superstate *)</span>
    displacement := lastplace * this_superstate;
    i := lastplace;
    <span style="color: #00ffff;">REPEAT</span>
        <span style="color: #00ffff;">IF</span> place[i].pl_cur &gt;= saves[i + displacement]
            <span style="color: #00ffff;">THEN</span> i := i - 1 <span style="color: #00ffff;">ELSE</span> i := -1
        <span style="color: #00ffff;">UNTIL</span> i &lt; 1;
    superstate := i = 0
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">superstate *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">parse *)</span>
<span style="color: #00ffff;">IF</span> writelisting &gt; 3 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">write</span>(listing,pathnum:0,<span style="color: #00ff00;">' '</span>,mode:1,<span style="color: #00ff00;">' '</span>,goal:1,<span style="color: #00ff00;">' '</span>);
    writenode(t)
    <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">IF</span> pathlength &lt;= maxlength <span style="color: #00ffff;">THEN</span>
  <span style="color: #00ffff;">WITH</span> code[t] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">CASE</span> op <span style="color: #00ffff;">OF</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">control *)</span>

        abort_op :
            maxlength := -1; <span style="color: #66f;">(* </span><span style="color: #66f;">instead of GOTO 1 *)</span>
        quit_op :
            <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">99</span>;
        nonterm_op :
            parse(right,cp);

<span style="color: #66f;">(* </span><span style="color: #66f;">mode *)</span>

        execute_op,verify_op,possibly_op :
            setmode(op,true,right);

<span style="color: #66f;">(* </span><span style="color: #66f;">regular *)</span>

        skip_op :
            cp;
        fail_op :
            ; <span style="color: #66f;">(* </span><span style="color: #66f;">do nothing *)</span>
        cat_op :
            parse(left,parseright);
        alt_op :
            <span style="color: #00ffff;">BEGIN</span>
            parse(left,cp);
            <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> fenced <span style="color: #00ffff;">THEN</span> parse(right,cp);
            <span style="color: #00ffff;">END</span>;
        opt_op :
            <span style="color: #00ffff;">BEGIN</span> cp; parse(right,cp) <span style="color: #00ffff;">END</span>;
        pos_op :
            <span style="color: #00ffff;">BEGIN</span> parse(right,cp); parse(right,sameagain) <span style="color: #00ffff;">END</span>;
        rep_op :
            <span style="color: #00ffff;">BEGIN</span> cp; parse(right,sameagain) <span style="color: #00ffff;">END</span>;
        timmes_op :
            times(left,right);
        showtotpathnum_op :
            <span style="color: #00ffff;">BEGIN</span> showtotpathnum := true; cp <span style="color: #00ffff;">END</span>;
        fence_op :
            <span style="color: #00ffff;">BEGIN</span> fenced := true; cp <span style="color: #00ffff;">END</span>;
        newscope_op :
            <span style="color: #00ffff;">BEGIN</span>
            i := ord(fenced); fenced := false;
            parse(right,restorefence)
            <span style="color: #00ffff;">END</span>;
        maxpaths_op :
            setinteger(maxpaths,left);
        pathnum_op :
            <span style="color: #00ffff;">IF</span> pathnum = left <span style="color: #00ffff;">THEN</span> cp;

<span style="color: #66f;">(* </span><span style="color: #66f;">boolean *)</span>

        false_op,true_op :
            <span style="color: #00ffff;">IF</span> (op = true_op) = goal <span style="color: #00ffff;">THEN</span> cp;
        logical_op :
            <span style="color: #00ffff;">WITH</span> place[right] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">IF</span> ord(goal) <span style="color: #00ffff;">IN</span> pl_cur <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    saveset := pl_cur;
                    pl_cur := [ord(goal)]; cp;
                    pl_cur := saveset
                    <span style="color: #00ffff;">END</span>;
        and_op,or_op :
            <span style="color: #00ffff;">IF</span> (op = and_op) = goal
                <span style="color: #00ffff;">THEN</span> parse(left,parseright)
                <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">BEGIN</span> parse(left,cp); parse(right,cp) <span style="color: #00ffff;">END</span>;
        not_op :
                parsenot(right,cp);
        imp_op :
            <span style="color: #00ffff;">IF</span> goal <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span>
                parsenot(left,cp);
                parse(right,cp)
                <span style="color: #00ffff;">END</span>
              <span style="color: #00ffff;">ELSE</span>
                parsenot(left,parseright);
        iff_op :
            <span style="color: #00ffff;">IF</span> goal <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span>
                parse(left,parseright);
                parsenot(left,parsenotright)
                <span style="color: #00ffff;">END</span>
              <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">BEGIN</span>
                parse(left,parsenotright);
                parsenot(left,parseright)
                <span style="color: #00ffff;">END</span>;
<span style="color: #66f;">(* </span><span style="color: #66f;">events *)</span>

        trans_op :
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> pathlength = maxpathlength <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span> writeln(<span style="color: #00ff00;">'path is too long'</span>); <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">99</span> <span style="color: #00ffff;">END</span>;
            pathlength := pathlength + 1;
            path[pathlength] := left; <span style="color: #66f;">(* </span><span style="color: #66f;">to symtab *)</span>
            parse(right,cp);
            pathlength := pathlength - 1
            <span style="color: #00ffff;">END</span>;
        net_op :
            parse(headnode,cp);
        len_op :
            times(left,headnode);
        tab_op :
            times(left-pathlength,headnode);
        position_op :
            <span style="color: #00ffff;">IF</span> pathlength = left <span style="color: #00ffff;">THEN</span> cp;
        maxlength_op :
            setinteger(maxlength,left);
        show_path_op :
            <span style="color: #00ffff;">BEGIN</span> show_path; cp <span style="color: #00ffff;">END</span>;

<span style="color: #66f;">(* </span><span style="color: #66f;">state *)</span>

        save_op :
            <span style="color: #00ffff;">BEGIN</span> save(left); cp <span style="color: #00ffff;">END</span>;
        restore_op :
            <span style="color: #00ffff;">BEGIN</span> restore(left); cp <span style="color: #00ffff;">END</span>;
        samestate_op :
            <span style="color: #00ffff;">IF</span> samestate(left) <span style="color: #00ffff;">THEN</span> cp;
        newstate_op :
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lastplace <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">WITH</span> place[i] <span style="color: #00ffff;">DO</span> pl_cur := pl_poss;
            cp
            <span style="color: #00ffff;">END</span>;
        substate_op :
            <span style="color: #00ffff;">IF</span> substate(left) <span style="color: #00ffff;">THEN</span> cp;
        superstate_op :
            <span style="color: #00ffff;">IF</span> superstate(left) <span style="color: #00ffff;">THEN</span> cp;

<span style="color: #66f;">(* </span><span style="color: #66f;">place *)</span>

        set_op :
            <span style="color: #00ffff;">WITH</span> place[left] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">IF</span> pl_cur * arc_opset &lt;&gt; [] <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    saveset := pl_cur;
                    pl_cur := arc_opset;
                    cp;
                    pl_cur := saveset
                    <span style="color: #00ffff;">END</span>;
<span style="color: #66f;">(* </span><span style="color: #66f;">! ! ! ! ! ! ! ! ! THIS NEEDS LOOKING AT ! ! ! ! ! ! ! ! ! ! *)</span>
        empty_op :
            <span style="color: #00ffff;">WITH</span> place[left] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">IF</span> (0 <span style="color: #00ffff;">IN</span> pl_cur) = goal <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    saveset := pl_cur;
                    <span style="color: #00ffff;">CASE</span> mode <span style="color: #00ffff;">OF</span>
                        execute_op,verify_op :
                            <span style="color: #00ffff;">IF</span> goal
                                <span style="color: #00ffff;">THEN</span> pl_cur := [0]
                                <span style="color: #00ffff;">ELSE</span> pl_cur := pl_poss - [0];
                        possibly_op :
                        OTHERWISE
                            point(<span style="color: #00ff00;">'F'</span>,
                                <span style="color: #00ff00;">'internal - emptyop            '</span>)
                        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
                    cp;
                    pl_cur := saveset
                    <span style="color: #00ffff;">END</span>;
        show_markings_op :
            <span style="color: #00ffff;">BEGIN</span> show_markings; cp <span style="color: #00ffff;">END</span>;
        arc_op :
            <span style="color: #00ffff;">WITH</span> place[left] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                saveset := pl_cur;
                <span style="color: #00ffff;">CASE</span> mode <span style="color: #00ffff;">OF</span>
                    execute_op :
                        <span style="color: #00ffff;">IF</span> pl_cur * arc_opset &lt;&gt; [] <span style="color: #00ffff;">THEN</span>
                            <span style="color: #00ffff;">BEGIN</span>
                            pl_cur := [];
                            <span style="color: #00ffff;">IF</span> right &lt; 0 <span style="color: #00ffff;">THEN</span>
                                <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">inarc *)</span>
                                <span style="color: #00ffff;">FOR</span> i := - right <span style="color: #00ffff;">TO</span> capacity <span style="color: #00ffff;">DO</span>
                                    <span style="color: #00ffff;">IF</span> i <span style="color: #00ffff;">IN</span> saveset <span style="color: #00ffff;">THEN</span>
                                        pl_cur := pl_cur + [i + right]
                                <span style="color: #00ffff;">END</span>
                              <span style="color: #00ffff;">ELSE</span>
                                <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">outarc_ *)</span>
                                <span style="color: #00ffff;">FOR</span> i := 0 <span style="color: #00ffff;">TO</span> capacity - right <span style="color: #00ffff;">DO</span>
                                    <span style="color: #00ffff;">IF</span> i <span style="color: #00ffff;">IN</span> saveset <span style="color: #00ffff;">THEN</span>
                                        pl_cur := pl_cur + [i + right]
                                <span style="color: #00ffff;">END</span>;
                            cp
                            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">execute *)</span>
                    verify_op :
                        <span style="color: #00ffff;">BEGIN</span>
                        <span style="color: #00ffff;">IF</span> goal
                            <span style="color: #00ffff;">THEN</span> pl_cur := pl_cur * arc_opset
                            <span style="color: #00ffff;">ELSE</span> pl_cur := pl_cur - arc_opset;
                        <span style="color: #00ffff;">IF</span> pl_cur &lt;&gt; [] <span style="color: #00ffff;">THEN</span> cp
                        <span style="color: #00ffff;">END</span>;
                    possibly_op :
                        <span style="color: #00ffff;">IF</span> goal <span style="color: #00ffff;">AND</span> (pl_cur * arc_opset = []) <span style="color: #00ffff;">OR</span>
                        <span style="color: #00ffff;">NOT</span> goal <span style="color: #00ffff;">AND</span> (pl_cur-arc_opset = []) <span style="color: #00ffff;">THEN</span> cp;
                    OTHERWISE
                        point(<span style="color: #00ff00;">'F'</span>,
                            <span style="color: #00ff00;">'internal: arc_op              '</span>);
                    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
                pl_cur := saveset
                <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WITH *)</span>
        deadlock_op :
            setmode(verify_op,false,headnode);
        unreachable_op :
            unreach(headnode,cp);
        OTHERWISE
            <span style="color: #00ffff;">BEGIN</span>
            writeln(<span style="color: #00ff00;">'internal error "parse", op = '</span>,op);
            <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">99</span>
            <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">parse *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">unreach</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">(n : integer; PROCEDURE cp) was forward *)</span>
<span style="color: #ff00ff;">VAR</span> saveset : markset;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">unreachright</span>;
      <span style="color: #00ffff;">BEGIN</span> unreach(code[n].right, cp) <span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">unreach *)</span>
<span style="color: #00ffff;">WITH</span> code[n] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">CASE</span> op <span style="color: #00ffff;">OF</span>
        arc_op :
            <span style="color: #00ffff;">WITH</span> place[left] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">IF</span> pl_cur - (pl_poss - arc_opset) &lt;&gt; [] <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    saveset := pl_cur;
                    pl_cur := pl_cur - (pl_poss - arc_opset);
                    cp;
                    pl_cur := saveset
                    <span style="color: #00ffff;">END</span>;
        trans_op :
            unreach(right,cp);
        and_op :
            <span style="color: #00ffff;">BEGIN</span> unreach(left, cp); unreach(right, cp) <span style="color: #00ffff;">END</span>;
        or_op :
            unreach(left,unreachright);
        OTHERWISE
            parse(n,cp)
        <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">unreach *)</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -  M A I N  - - - - - *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">main, NETVER *)</span>
10:
initialise;
<span style="color: #00ffff;">REPEAT</span>
    codeindex := 0; lastsymtab := 0; lastplace := 0;
    headnode := 0; <span style="color: #66f;">(* </span><span style="color: #66f;">will be inspected in block and below *)</span>
    <span style="color: #00ffff;">IF</span> interactive_usage <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">write</span>(<span style="color: #00ff00;">'?-  '</span>);
    getsym;
    <span style="color: #00ffff;">IF</span> sym = quit_op <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">90</span>;
     block;
    <span style="color: #00ffff;">IF</span> writelisting &gt; 10 <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        writeln(listing);
        writeln(listing,<span style="color: #00ff00;">'total code for block:'</span>);
        <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> codeindex <span style="color: #00ffff;">DO</span> writenode(i);
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">IF trace &gt; 0 *)</span>
    <span style="color: #00ffff;">WHILE</span> sym = path_ <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        codeindex := last_block_code; getsym;
        new_id_allowed := false; expression;
        <span style="color: #00ffff;">IF</span> trace &gt; 0 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span> writeln; writeln(<span style="color: #00ff00;">'code to be executed:'</span>) <span style="color: #00ffff;">END</span>;
        <span style="color: #00ffff;">FOR</span> i := last_block_code + 1 <span style="color: #00ffff;">TO</span> codeindex <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">WITH</span> code[i] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">IF</span> op = nonterm_op <span style="color: #00ffff;">THEN</span>
                    right := symtab[left].val; <span style="color: #66f;">(* </span><span style="color: #66f;">fixup *)</span>
                <span style="color: #00ffff;">IF</span> trace &gt; 0 <span style="color: #00ffff;">THEN</span> writenode(i)
                <span style="color: #00ffff;">END</span>;
        maxlength := maxint; pathnum := 1; pathlength := 0;
        maxpaths := maxint;
        fenced := false; mode := execute_op; goal := true;
        showtotpathnum := false;
        <span style="color: #00ffff;">IF</span> trace &gt; 0 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span> writeln; writeln(<span style="color: #00ff00;">'executing ...'</span>) <span style="color: #00ffff;">END</span>;
        parse(codeindex,skip);
        <span style="color: #00ffff;">IF</span> showtotpathnum <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            show_tot_num_paths(output);
            <span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEn</span> show_tot_num_paths(listing)
            <span style="color: #00ffff;">END</span>;
        <span style="color: #00ffff;">IF</span> sym = semicol_ <span style="color: #00ffff;">THEN</span> getsym
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ffff;">UNTIL</span> false;
90: ;
99: finalise;
<span style="color: #00ffff;">END</span>. <span style="color: #66f;">(* </span><span style="color: #66f;">main, NETVER *)</span>
</pre>
</div>
</div>
</div>
