text/20-petri-net-verifier.org
* Discussion

Obviously the system is in need of numerous improvements.  The following sections discuss most of them, organised into

1) mere embellishments to the user interface,
2) improvements of the backtracking mechanism, and
3) greater power of the Petri net language.

** Embellishments

The system was written very much as a prototype, and no attempt was made to endow it with the kinds of niceties one expects from a final system.  A more mature version should make its use more convenient, and here are some desirable features:

** /Error recovery/:
At least initially, specifications of nets to be verified are not likely to be large.  Nevertheless, it would be helpful if the parser could continue after the first error and perform further checking.  The techniques of simple error recovery are well understood (see for example the Datbas program in Chapter 19), and their incorporation should not present any problems.

** /String output/:
Currently the only output produced by the verifier is either a path or a marking.  It would make the reading of such output much easier if users could also intersperse such output with meaningful remarks and explanations --- expressed as character strings.  Two options exist here: that the output is produced at the time of interpretation, or that it is saved away in the path, to be produced only upon completion of the path.  Probably both methods are useful.

** More advanced backtracking

The comments in this section pertain to the backtracking methods of the verifier, they would apply equally well to one which does not operate on nets.

** /Regular and Boolean Algebra/:
The verifier allows one to mix concepts from two rather distinct algebras, and the several modes of the verifier are geared to the two algebras.  However, the examples as yet do not fully exploit the possibilities arising from the interaction of the two algebras.  So some theoretical research is needed to examine the interplay between the two algebras, and some practical research is needed to determine the usefulness of having the two together in a verifier of this kind.

** /Other Primitives/:
The verifier offers a collection of general primitives for programmed backtracking which are quite independent of the concepts of the nets being verified.  It would be useful to survey the literature to determine whether there are any other generally applicable primitives, and whether there are any generally applicable methods of combining them apart from the ones offered here.  Klint (1985, pp 31 - 36) describes an elegant, clean and powerful construct called =try ..= for the control of backtracking and environment modification in string processing languages.  It would appear that the construct is equally useful in any backtracking language.

** /Optimisations/:
The verifier as described does not use any optimisations.  But there are several well-known techniques applicable to backtracking; some depend on the system being modelled, others do not.

1) Specifically for regular algebras, there is an optimisation, called the length check in Waite (1973, p 264) and called the futility heuristic in the implementation of Snobol (Griswold 1972, p 126): if the completion of the current path requires more atoms (characters in a parsing situation, transition firing in a modeling situation) than are available (in the string to be parsed, in the path to be attempted), then it is futile to continue.

2) Specifically for Boolean algebras, there is a heuristic familiar to logicians using the /semantic tableaux/ method: if a choice is to be made between branching now or later, branch later - for example when attempting to verify =(p OR q) AND (r AND s)=, treat it like =(r AND s) AND (p OR q)= by expanding =r AND s= first.

3) The two methods above are specific to their subject matter, but there is another which is independent, the intelligent backtracking technique: if failure occurs due to a choice made early in the process, do not backtrack blindly to other choices made later but backtrack immediately to the point which caused the failure.  Van Hentenryck (1989, pp 60 - 69) and Lauriere (1990, pp 211 - 218 and pp 389 - 449) describe some very sophisticated techniques which are even more intelligent: they minimise backtracking by not making choices that can be known in advance to lead to failure.  All these optimisations can produce almost arbitrary speedup for suitably chosen inputs; but clearly they involve some overhead, and whether the overhead is worth it depends on statistical properties of the actual mix of inputs which is impossible to assertain in a vacuum.  An attempt to incorporate intelligent backtracking for just reachability analysis in Netver is reported in Wong (1991).

** A more powerful object language

The verifier described here operates on Petri nets of almost the simplest kind (the simplest kind would be one in which all place capacities are one).  A great deal of current research has been concerned with what generally are called higher level nets.  This section discusses some of the ways in which the verifier could be extended for such higher level nets.

*** /Folding of places/:
For the nets of this verifier, the places are really integer variables, but are thought of as containing tokens --- all of the same kind, and as many as indicated by the value of the variable.  In another species of nets the places are thought of as containing several kinds of tokens, and for each kind it has to be indicated how many there are.  Such places are best thought of as being combinations of simpler places each containing only one kind of token, and hence they may be represented by records of several integers, one for each kind.  No difficulty should be experienced with adapting the verifier to deal with such places.

*** /Predicate Transition Nets/:
In the simplest case the maximum capacity for each kind of token is one.  So for each kind it is either false or true that the place contains a token of that kind, and hence such places are in fact set variables.  Again it should be easy to adapt the verifier for such places.

