20-petri-net-verifier.html
<div id="outline-container-sec-10-8-3" class="outline-4">
<h4 id="sec-10-8-3"><span class="section-number-4">10.8.3</span> <i>Queueing places</i>:</h4>
<div class="outline-text-4" id="text-10-8-3">
<p>
In all the nets considered so far, tokens upon arrival at a place do not retain any temporal ordering of their arrival.  In nets with queueing places the tokens retain this ordering, and typically the first one to arrive will be the the first one to leave.  Such places are really queues &#x2014; either bounded or unbounded, which may be implemented as (perhaps circular) arrays or as linked lists.  A special case is the queue of size one, a buffer or mailbox, suitable for asynchronous communication.  The incorporation of bounded queueing places in the form of circular arrays should not present any difficulty for a future version of the verifier.
</p>
</div>
</div>
<div id="outline-container-sec-10-8-4" class="outline-4">
<h4 id="sec-10-8-4"><span class="section-number-4">10.8.4</span> <i>Timed Petri Nets</i> (see e.g. Carlier et al 1984):</h4>
<div class="outline-text-4" id="text-10-8-4">
<p>
If timing information of the arrival of tokens is not merely ordinal but subject to a metric, perhaps even system wide, then it becomes possible to force tokens to "age" for a specified time before they can be removed from a place.  By endowing a transition (or a set of transitions) with a timing place to which there is (are) both output and input arcs, it becomes possible to restrict the frequency of firing of the transition (or the transitions in the set).  At this stage it is not known how well the verifier in its present form could handle any such timing information.
</p>
</div>
</div>
<div id="outline-container-sec-10-8-5" class="outline-4">
<h4 id="sec-10-8-5"><span class="section-number-4">10.8.5</span> <i>Parallelism in Paths</i>:</h4>
<div class="outline-text-4" id="text-10-8-5">
<p>
The path expressions of Netver do not include the parallel composition operator and its two special forms for interleaving and synchronisation (see Bolognesi and Brinksma 1987, or ISO 1987).  Their eventual inclusion is being contemplated, but will probably require substantial revision of the code.
</p>
</div>
</div>
<div id="outline-container-sec-10-8-6" class="outline-4">
<h4 id="sec-10-8-6"><span class="section-number-4">10.8.6</span> <i>Ports</i>:</h4>
<div class="outline-text-4" id="text-10-8-6">
<p>
A process can use a buffer to deposit information and then proceed at its own pace, and another process can eventually inspect what is in the buffer.  There is no requirement that the depositing and the inspecting occur at the same instant.  This is not true of PORTs, which are used for synchronous communication: if one of the two processes comes to the point of wanting to deposit or inspect, and the other one is not ready, then the first process has to wait.  Again it is not known whether the verifier could be adapted to handle ports.
</p>

<p>
A Pessimistic Note:
</p>

<p>
Part of the success of the current verifier depends on the fact that it uses hypermarkings instead of markings.  This works well for places having small capacities, up to, say, 31.  Then any actual marking is an integer 0 .. 31, and a hypermarking is a <code>SET OF 0..31</code>, still representable by 32 bits and easily processed.  For places containing tokens of a few kinds, there are two possibilities: either
</p>
<ol class="org-ol">
<li>treat such places as a collection of the more elementary places, or
</li>
<li>retain the principle of squeezing a hypermarking into 32 bits, by allowing up to 15 tokens of two kinds, up to 7 tokens of four kinds, up to 3 tokens of eight kinds, and only one token of sixteen kinds.
</li>
</ol>

<p>
But for places containing tokens of more than just a few kinds this method will not be possible.  Already for the type character there are too many kinds &#x2014; 128 or 256 &#x2014; and even for a maximum place capacity of only one, a hypermarking would need that many bits, seven or eight 32 bit words.  So already for character places the method of hypermarkings becomes only marginally feasible.  On the other hand, it would appear that the character type, and even more so the integer and string types are mainly needed inside buffers, queues and ports.  Typically the firing of transitions will depend not on fine detail of what is inside, but on what can be represented by a much smaller collection of kinds.  For example, if the firing of one transition depends on an integer being less that 100, and the firing of another transition depends on its being less than 10000, then as far as the verifier need be concerned there are just three kinds.
</p>
</div>
</div>
<div id="outline-container-sec-10-8-7" class="outline-4">
<h4 id="sec-10-8-7"><span class="section-number-4">10.8.7</span> <i>Reading</i>:</h4>
<div class="outline-text-4" id="text-10-8-7">
<p>
A large number of sophisticated systems somewhat similar to Netver are described in the collection edited by Sifakis (1990).
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
